{
  "newspapers": {
    "bbc": {
      "rss": "http://feeds.bbci.co.uk/news/business/rss.xml",
      "link": "http://www.bbc.com/",
      "articles": [
        {
          "title": "Flat owner hit with £65,000 fire safety cladding bill as block too short for funding",
          "text": "Flat owner hit with £65,000 cladding bill as block too short for funding\n\n2 days ago Share Save Danielle Codd Business reporter Share Save\n\nBBC Tom says he worries constantly about how he's going to pay to make his building safe\n\nFlat owners are being hit with huge bills for fire safety work because their blocks are not tall enough to qualify for funding announced after the Grenfell Tower fire. The previous government launched the Building Safety Act after the 2017 fire which killed 72 people. But the rules do not apply to buildings under 11m (36ft) or five storeys high. Some lawyers claim the new law was \"rushed\" but the government says it covers the majority of leaseholders and it will continue to review the legislation. Paramedic Tom DeRonde received a £65,000 bill because his flat is in a three-storey building and says he faces bankruptcy.\n\n\"I had to take a month off work with stress. There's not been a day when I've not thought about cladding,\" he told the BBC. It is estimated there are 1.3 million leasehold flats in low-rise blocks, under 11m high in England, according to the End Our Cladding Scandal campaign. Tom bought his flat in Luton in 2018 with money he had saved from serving in the army. He said when he came home to a bill for £65,000 he was \"absolutely shocked\". The invoice from his landlord was his legal share of the costs to make the building fireproof. \"I thought it was a typo to be honest,\" said Tom. Then he learnt the building's height meant he was a \"non-qualifying leaseholder\" and would be liable to pay for fire safety work.\n\nTom climbed a ladder and measured his block of flats himself - it falls outside the protections of the law at 9m tall\n\n\"The government says for buildings under 11m, the risk can be mitigated by other means, like using fire alarms and sprinkler systems but in my case, that's not true,\" explained Tom. \"I've had two fire assessments both saying the cladding is dangerous and needs to be removed, and the price, which they also said would be lower for smaller buildings, is extortionate. I can't pay,\" he added. After complaining to the building's owners, Tom expects the bill to be reduced but is yet to find out by how much. Tom had planned to sell the flat to buy a family home but can't. \"It's ruining my life and I'm facing bankruptcy,\" he said. The Department for Housing told the BBC that owners of buildings under 11m should not pass on the costs of fixing historical safety defects to leaseholders. But the law does not prevent people like Tom being billed for unlimited amounts of money when the developers are no longer around or landlords cannot afford the remediation costs.\n\n'Falling through the gaps'\n\nLiz Ramsden is an expert in leasehold property at Knights and told the BBC she believes the Building Safety Act was drafted too quickly. \"The intention was that no leaseholder would have to pay but in reality we are finding a lot of leaseholders are having to pay huge sums of money. \"There was very little consultation and because of that we have these gaps in the legislation and people are falling through,\" she said. Even in buildings above 11m the rules fail to protect many leaseholders. Homeowners with Islamic mortgages or three or more properties also do not benefit from the full protections. This is something Martin Batty, who has an Islamic mortgage, only discovered when he put his one-bedroom flat up for sale. He said his lawyer explained the way Islamic home purchase plans are structured - to comply with Sharia law which does not allow paying interest - means he falls outside the scope of the act. \"It feels really unfair. I feel like I'm being discriminated against,\" he said.\n\nMartin Batty Martin Batty's Sharia mortgage on a leasehold flat means he's struggling to sell his property\n\n\"To find out that I'm a non-qualifying leaseholder just because I've got an Islamic home purchase plan is a huge kick in the teeth. It's really upsetting and is a huge let down.\" The government told the BBC Islamic interest free loans secured against properties were very rare. But Martin said he can't sell his flat because mortgage providers will not lend against it and solicitors won't advise on non-qualifying leases.\n\nSuzy and Colin outside their flats in Salford\n\nSuzy Spilling and her husband Colin invested in four rental properties to fund their retirement - including two flats in Salford \"mortgaged to the hilt\". These two flats are in a building where lots of the cladding has been found to be unsafe. The government will fund the removal but because the couple have more than three properties they too are non-qualifying leaseholders and will have to pay towards the costs of making the tower block fire-safe. \"Everything we have planned for would be out the window,\" said Suzy. \"How were we going to raise the funds needed? We could be on the hook for £100,000 for each of our two apartments.\" It is estimated there are 385,000 flats in England owned by non-qualifying leaseholders like Suzy and Colin, according to the End Our Cladding Scandal. The couple have gone back to work to save money \"but there's no way we're going to be able to cover the amount we're going to have to pay,\" she added. \"Our lives are on hold. We don't know when it's ever going to end.\"",
          "link": "https://www.bbc.com/news/articles/c14n6ngkrzeo",
          "published": "2025-02-28T22:28:05"
        },
        {
          "title": "US-UK trade deal: Would an agreement change anything?",
          "text": "Faisal Islam: Any Starmer deal with Trump is all about avoiding tariffs\n\n2 days ago Share Save Faisal Islam • @faisalislam Economics editor Share Save\n\nGetty Images\n\nThe US-UK trade deal warmly suggested by President Donald Trump should help insulate the UK from the direct impact of global trade tensions. It signals that the White House has accepted the statistical logic that the US and UK have a balanced trade position. Essentially each country roughly exports the same amount of goods to one another. Indeed, rather helpfully, according to the US numbers it exports more. There is no general case that the UK is, in the words and logic of the president, \"ripping off\" or \"screwing\" the US, as he has suggested of many other countries and the EU. So a deal to avoid the further trade barriers is very much on the cards. But this is not the wideranging US-UK free trade agreement to lower almost all existing tariffs, that was the subject of so much debate in the Brexit era. It is important to remember that the wider deal was never properly prioritised by Trump's own team, because, as they told me, they never truly believed that the UK would find it in its interest to make the necessary hard break from the EU. It is difficult to see that the UK government would want to further aggravate farmers, or its own base, by putting US farm imports or NHS pricing on the table. In addition, on goods trade, the government is already prioritising its \"Brexit reset\" - a food standards deal, and some customs arrangements to bring down newish trade barriers with the European Union. Tellingly, the top official on that negotiation was in the Oval Office.\n\nThe narrower \"economic deal\", as it was termed by Sir Keir Starmer, centres around technology and what the UK has referred to as the \"further integration of our two countries' tech sectors\". Perhaps the best analogy is that the tech expertise held within the London-Oxford-Cambridge triangle could become for a booming AI-driven Silicon Valley what London's financial City became to New York's Wall Street. The fact that Vice President and big tech ally JD Vance will be leading some of the US negotiation is key here. This strategy will have consequences. Trump's team are already railing against digital services taxes. The UK's digital services tax was introduced in 2020 and imposes a 2% charge on revenues made by big tech firms running social media, internet search engines or online marketplaces. While the £700m-£1bn a year it raises in the UK is smallish beer, since the UK and France introduced a hit to big tech's revenues, many other countries have followed suit. The White House wants to \"stop the contagion\", and that could mean persuading the UK to lower or abolish it. Chancellor Rachel Reeves advocated raising it from 2% to 12% just four years ago. Likewise the vice president in the Oval Office mentioned US tech firms being unfairly affected by what he called \"freedom of speech\" issues. This appears to be a reference to the Online Safety Act. This aims to make social media firms and search engines protect children and adults in the UK from illegal, harmful material, although some have argued it risks stifling free expression online. My understanding is that, right now, movement may be less likely here.\n\nGetty Images",
          "link": "https://www.bbc.com/news/articles/cedll3282qzo",
          "published": "2025-02-28T14:11:21"
        }
      ]
    },
    "bloomberg": {
      "rss": "https://www.bloomberg.com/feed/podcast/bloomberg-businessweek",
      "link": "https://www.bloomberg.com/",
      "articles": []
    },
    "business_insider": {
      "rss": "https://www.businessinsider.com/rss",
      "link": "https://www.businessinsider.com/",
      "articles": [
        {
          "title": "I bought my first house in Florida. I would've been better off if I'd done these 5 things beforehand.",
          "text": "After years of living in Miami, I bought a house in Florida. I realized there's a lot I don't know.\n\nI didn't realize my home-insurance options would be somewhat limited in Florida.\n\nShortly into homeownership, pest control and tree removal became unexpected expenses.\n\nRecently, I made one of the biggest personal and financial decisions of my life: buying a house in Florida.\n\nI'm a millennial from West Virginia, and I'd been living in Miami for seven years. I was excited to officially put down roots in the area I'd fallen in love with.\n\nI felt pretty prepared to purchase my property since my parents owned our house when I was a teenager, and I grew up hearing about the general costs, burdens, and benefits that come with being a homeowner.\n\nHowever, I quickly discovered just how much I really didn't know. Here are five things I wish I'd done before buying my house in Florida.\n\nI wish I'd researched how few companies insure homes in Florida\n\nI've lived in Florida for the better part of a decade, so I've seen how volatile the weather can be.\n\nHowever, I never thought that would (or even could) stop well-known insurance companies from offering new policies to Florida homeowners.\n\nBecause of my state, big names like Progressive and Costco Insurance Agency weren't even options when I was looking to insure my property.\n\nI ended up getting an incredible insurance deal from a smaller company that still operates in South Florida. Still, I wish I'd known how few options I'd really have when it came to protecting my property.\n\nI should've checked how much my new ZIP code would impact my car-insurance rate\n\nMiami has several ZIP codes. Franz Marc Frei/Getty Images\n\nI didn't research my ZIP code as well as I should have when I bought my house.\n\nAfter all, I had a lot of other things to worry about, and I'd lived in different parts of Miami-Dade County before. However, this area alone has 34 incorporated municipalities and various unincorporated neighborhoods.\n\nDifferent parts of Dade have their own ZIP codes, and car-insurance premiums can vary based on which you live in. This isn't only the case in Florida, either.\n\nI should've taken more time to research exactly how my new ZIP code would impact my car insurance — especially because I'll be living here for a while.\n\nI wish I'd researched how expensive tree removal can be before buying the property\n\nOnce I'd moved in, some tree branches started falling from a massive banyan in my yard — and I started researching how much it would cost to remove the tree.\n\nRelated stories\n\nThe best quote I got was $12,000 due to the scope of the project.\n\nHad I also known how expensive tree removal can be in South Florida (and in general), I may have paid extra to have the trees examined before closing or even considered a different property.\n\nIt would've been helpful to visit my new neighborhood after a rainstorm to see how much it floods\n\nIt's hard to avoid flooding in South Florida. Lokman Vural Elibol/Anadolu via Getty Images\n\nThere's really no way to totally avoid minor flooding in South Florida.\n\nA lot of places flood Miami — even during day-to-day rain showers. It doesn't matter if you're on Miami Beach or a few miles inland.\n\nHowever, it would've been nice to know how it would impact me on a regular basis before I bought my home.\n\nAlthough the street I live on doesn't flood too much, the main streets I use to get to my house do. I wish I'd thought to come by after a storm one day to see where flooding impacts my neighborhood the most.\n\nI wish I'd known more about pest control before purchasing a home here\n\nUnfortunately, Florida's climate is a favorable one for a lot of creatures I don't want in my home.\n\nWhen I was a renter, my landlords were in charge of pest control — and, thankfully, they were quick to resolve any insect-related issues at the properties where I used to live.\n\nBecause it had never been my responsibility before, I didn't know how to keep my property free of termites, palmetto bugs, snakes, and iguanas.\n\nThis was something I had to learn very quickly from friends who have lived in Florida all their lives.\n\nPest-control services are an expense I was not expecting at first, but I'm very grateful the pros have taught me how to protect my home before any full-blown infestations could begin.",
          "link": "https://www.businessinsider.com/buying-first-house-florida-mistakes-wish-i-did-differently-2025-3",
          "published": "2025-03-02T14:28:02"
        }
      ]
    },
    "cnbc": {
      "rss": "https://www.cnbc.com/id/10001147/device/rss/rss.html",
      "link": "https://www.cnbc.com/",
      "articles": [
        {
          "title": "How a $5 million fix turned Paramount Pictures' 'Sonic' into a billion-dollar franchise",
          "text": "In this article PARA Follow your favorite stocks CREATE FREE ACCOUNT\n\nParamount Pictures revamped version of Sonic the Hedgehog (r). Source: Paramount Pictures\n\nSonic the Hedgehog may be able to run faster than the speed of light, but his film franchise nearly came to a screaming halt in 2019. A less-than-three-minute trailer released early that year to tease the film's release, which was just six months away, was widely panned by fans who took to social media to rail against Paramount's character design. Dubbed \"Ugly Sonic,\" the blue creature that appeared on film was a far cry from the iconic video game speedster. Cinematic Sonic, version 1, had more realistic facial features, including human-like teeth, and his body proportions were deemed inconsistent with the character fans grew up with in the '90s. \"The trailer goes out, and I think it became the most viewed trailer in the history of Paramount Pictures. Which is amazing,\" said Toby Ascher, who acquired the rights to Sonic and produced the film franchise. \"The only problem was that 90% of people hated the trailer because of the design of Sonic.\" \"All of a sudden we went from trying really, really hard to make a really, really faithful video game adaptation to being next in line of the people who had ruined video games for everyone. It just was a disaster of epic proportions,\" Ascher added. The studio pivoted, opting to redesign the title character and push the film's release back three months to February 2020. The fix cost Paramount around $5 million but resulted in a franchise that has generated nearly $1.2 billion at the global box office. The studio hopes to build on that momentum with a fourth installment in the film franchise, set to debut in 2027. \"The Sonic franchise owes its box office success and longevity to a monumental decision early in the development of the first films' marketing campaign,\" said Paul Dergarabedian, senior media analyst at Comscore. \"A re-design of a main character is no small thing. ... These decisions can make or break what is every studio's dream of having a single film turn into a long-term revenue generating franchise. The return on investment by turning an 'ugly' Sonic into a beautiful revenue generating franchise is undeniable.\"\n\nBringing Sonic to the big screen\n\nAscher first acquired the rights to Sonic the Hedgehog in 2013, a time in Hollywood when video game-inspired films had failed to resonate with audiences. \"When we first started working on Sonic, making a video game adaptation was, like, a really bad idea,\" he told CNBC. No film based on a video game property had, to that point, managed to earn a positive rating from review aggregator Rotten Tomatoes. It wasn't until 2019 that a video game-based film generated a \"fresh\" rating on the site, indicating more than 60% positive reviews.\n\nBen Schwartz voices Sonic in Paramount Pictures' \"Sonic the Hedgehog.\" Paramount Pictures\n\n\"I don't think anyone in town really thought making a Sonic movie was a good idea,\" Ascher said. \"But, I think our strategy was that we had grown up with these games. We've grown up with these characters, and we wanted to treat them like any other character. We wanted to give them real emotional arcs, and real emotional stories where you could relate to them.\" Ascher noted that previous video game adaptations typically focused on worldbuilding rather than character development. \"What we've been able to do is inject into the franchise heart, and I think that that's what's made it different,\" said Neal Moritz, Ascher's producing partner and producer of franchises like \"The Fast and the Furious\" and \"21 Jump Street.\" Both Ascher and Moritz noted that while the filmmaking team behind the first \"Sonic the Hedgehog\" film overhauled the main character's design, the story remained pretty much the same.\n\n'We really screwed up'\n\nThe filmmaking team was blindsided by audiences' reactions to the first trailer, but were resolute in trying to resolve the issue rather than shelve the film or release it in its current form. Moritz said he made an \"impassioned speech\" to the heads of Paramount and Sega to allow the filmmakers to fix the mistake.\n\nParamount Pictures\n\nAs Moritz recalls, he told executives: \"We really screwed up here, but there's an incredible amount of interest and what we need to do is fix it ... We need some more money and we need some more time. If you give that to us, I think we could turn this thing around.\" \"I give both Paramount and Sega a lot of credit,\" Moritz said. \"They said 'OK.'\" In the redesign, the team brought back Sonic's iconic white gloves and classic red shoes. They reinfused the character with some of his cartoon roots, and six months after the first trailer, Paramount released a new iteration. \"The fans saw that we were trying to be really genuine in our love for this franchise,\" Ascher said, noting that in the wake of the first trailer the team began engaging more with fans and focus groups to drum up feedback and inspiration. The new trailer was well-received by fans, and three months later \"Sonic the Hedgehog\" opened to $58 million at the box office. The feature went on to collect $146 million domestically before the pandemic shuttered theaters. Globally, it pulled in $302 million.\n\nThe future of Sonic\n\nThe Sonic franchise has continued to thrive in the following years, with each follow-up feature outperforming the last. \"Sonic the Hedgehog 2\" snared $190 million domestically and $403 million globally, while \"Sonic the Hedgehog 3\" tallied $235 million stateside and $485 million worldwide. \"That's a big jump,\" said Marc Weinstock, Paramount's president of worldwide marketing and distribution. \"I get excited that every new movie does better than the last one, which is rare.\" Following the success of the second \"Sonic\" film, the studio's then-president and CEO of Paramount Pictures, Brian Robbins, greenlit a \"Knuckles\" series based on the franchise for the company's streaming service, Paramount+, as well as a third Sonic film. Sonic was becoming multi-platform, much like Robbins and Paramount had done for franchises like \"Teenage Mutant Ninja Turtles,\" \"A Quiet Place,\" \"Spongebob Squarepants\" and \"Paw Patrol.\" The \"Knuckles\" show generated more than 11 million global viewing hours in its first 28 days on Parmount+. The theatrical success also rocketed Sonic from a $70 million licensing business to one that generates more than $1 billion in retail revenue annually, according to Ivo Gerscovich, Sega's senior vice president and chief business and brand officer of Sonic the Hedgehog. \"The great thing about Sonic — and the success of Sonic from the very beginning — is that we basically have listened to the fans from day one,\" Robbins, now co-CEO of Paramount, said. \"The fans are fanatical about this franchise and love this franchise and know this franchise. Because of that, they've become really key in shaping the franchise ... They evangelize it.\"\n\nStill from Paramount's \"Sonic the Hedgehog 2.\" Paramount",
          "link": "https://www.cnbc.com/2025/03/01/paramount-sonic-fix-billion-dollar-franchise.html",
          "published": "2025-03-01T13:00:01"
        },
        {
          "title": "Trump administration, Musk’s DOGE plan to fire nearly all CFPB staff and wind down agency, employees say",
          "text": "Elon Musk holds up a chainsaw onstage during the Conservative Political Action Conference (CPAC) in National Harbor, Maryland, U.S., February 20, 2025.\n\nThe Consumer Financial Protection Bureau's Trump-appointed leadership plans to fire nearly all its 1,700 employees while \"winding down\" the agency, according to testimony from employees.\n\nIn a trove of statements released late Thursday, federal employees said that the mass layoff was discussed in meetings they attended this month with senior CFPB leaders and members of Elon Musk's so-called Department of Government Efficiency.\n\n\"My team was directed to assist with terminating the vast majority of CFPB employees as quickly as possible,\" said an employee identified as Alex Doe, a pseudonym used out of fear of retaliation.\n\nDoe said the plan from CFPB leaders and DOGE was to cut the bureau's workforce in three phases. It would first eliminate probationary and term employees, then carry out a wave of about 1,200 layoffs, leaving a skeleton crew of a few hundred workers.\n\n\"Finally, the Bureau would 'reduce altogether' within 60-90 days by terminating most of its remaining staff,\" Doe said.\n\nThe workers' testimony comes at a crucial time for the CFPB, the agency created to protect consumers after the 2008 financial crisis caused by irresponsible lending. Since DOGE operatives first arrived at the CFPB this month, the bureau has shuttered its Washington headquarters, initiated the first round of layoffs and told those who remain to stop nearly all work.\n\nThe department has also reversed course on several cases where it accused financial firms including Capital One of ripping off customers, dismissing at least four cases Thursday involving billions of dollars in alleged consumer harm.\n\nThe filings containing the employee statements were made in the case started by a CFPB union, which led to a judge suspending acting Director Russell Vought's moves to shutter the bureau. After the CFPB fired about 200 probationary and term employees, the agency's actions were put on hold until a March 3 hearing.",
          "link": "https://www.cnbc.com/2025/02/28/cfpb-leaders-and-elon-musk-doge-planned-to-fire-nearly-all-staff.html",
          "published": "2025-02-28T17:39:02"
        }
      ]
    },
    "coindesk": {
      "rss": "https://www.coindesk.com/arc/outboundfeeds/rss/",
      "link": "https://www.coindesk.com/",
      "articles": [
        {
          "title": "Ethereum Foundation Picks New Co-Executive Directors, Following Leadership Reshuffle",
          "text": "The Ethereum Foundation (EF), the non-profit organization that supports the development and research of the Ethereum blockchain, shared in a blog post on Saturday that they have selected Hsiao-Wei Wang and Tomasz Stańczak as their new co-executive directors.\n\nSTORY CONTINUES BELOW Don't miss another story. Subscribe to the The Protocol Newsletter today . See all newsletters Sign me up By signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy .\n\nThe news follows Tuesday’s announcement of Aya Miyaguchi leaving that role to become the EF’s new president. The leadership shake-up follows intense debate among the community about the EF’s role in the ecosystem, as some have blamed the organization and its leadership for the blockchain’s token ether (ETH) price lagging behind other cryptocurrencies, while the blockchain attracted for the first time less new developers than its competitor Solana.\n\nWang has been at the EF since 2017, where she helped do research on concepts like sharding, as well as contributed to Ethereum’s major overhaul known as “the Merge.” Stańczak founded Nerthermind, one of the largest software or clients that operate the Ethereum blockchain.\n\n“Over the next few years, the Ethereum ecosystem needs to navigate the challenging transition from being an early-stage project serving a small number of enthusiasts to being a robust permissionless censorship-resistant base layer of the global finance and software stack,” the Foundation said in their blog post.\n\nMore shuffling\n\nIn addition to Wang and Stańczak assuming their new roles, ex-EF researcher Danny Ryan shared that he would be joining Etherealize, the new project aimed at bringing ETH to Wall Street. The firm was founded by former banker Vivek Raman, who shared previously with CoinDesk that one of the goals of Etherealize is to bridge the gap between Ethereum and the banks by educating institutions and marketing ETH as a serious crypto asset.\n\nIn a post shared on X, Ryan said that he intends “to build a new Ethereum institution with Real World Ethereum as its north star.”\n\n“The world is ready to come on-chain, and we’re here to do the hard work necessary to make it happen,” Ryan added.\n\nRead more: Ethereum Foundation’s Aya Miyaguchi Leaving Executive Director Role\n\n\n\n",
          "link": "https://www.coindesk.com/tech/2025/03/01/ethereum-foundation-picks-new-co-executive-directors-following-leadership-reshuffle",
          "published": "2025-03-01T20:02:11"
        },
        {
          "title": "Ethereum Co-Founder Vitalik Buterin Calls Roger Ver's Potential Life Sentence 'Absurd'",
          "text": "Roger Ver, an early bitcoin (BTC) investor who was once known as “Bitcoin Jesus” for his support of the cryptocurrency, was indicted for alleged tax fraud last year and could be sentenced to life in prison.\n\nSTORY CONTINUES BELOW Don't miss another story. Subscribe to the State of Crypto Newsletter today . See all newsletters Sign me up By signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy .\n\nNow, many industry veterans are coming to his support, including Ethereum co-founder Vitalik Buterin, who called the potential sentence “absurd.”\n\n“Going to prison for the rest of your life over non-violent tax offenses is absurd,” Buterin said on a social media post. “The case against Roger seems very politically motivated; like with Ross Ulbricht, there have been plenty of people and corporations who have been accused of far worse and yet faced sentences far milder than what Roger is facing.”\n\nGoing to prison for the rest of your life over non-violent tax offenses is absurd. The case against Roger seems very politically motivated; like with @RealRossU, there have been plenty of people and corporations who have been accused of far worse and yet faced sentences far… https://t.co/7G3zDkn2F2 — vitalik.eth (@VitalikButerin) March 1, 2025\n\nHis words come after Silk Road founder Ross Ulbricht, who was sentenced to life in prison for creating the darknet marketplace and later pardoned by U.S. President Donald Trump, showed support for Ver, saying no one should “spend the rest of their life in prison over taxes.”\n\n\n\nSimilarly, Kraken founder Jesse Powell has argued in Ver’s defense. “The reality is, they just don't like him and they want to get him, and they will use any excuse they can to get him or make his life hell for as long as they can.”\n\n\n\nVer and his legal team are challenging the case, arguing that the charges brought against him are politically motivated.",
          "link": "https://www.coindesk.com/policy/2025/03/01/ethereum-co-founder-vitalik-buterin-calls-roger-ver-s-potential-life-sentence-absurd",
          "published": "2025-03-01T19:45:42"
        },
        {
          "title": "Swiss National Bank President Dismisses BTC as Reserve Asset",
          "text": "Swiss National Bank (SNB) President Martin Schlegel has rejected the idea of holding bitcoin as part of Switzerland’s central bank reserves, citing a lack of stability, liquidity, and security, according to local media.\n\n\n\nSpeaking to the Tamedia group, Schlegel cited three primary concerns surrounding cryptocurrencies. The first one is their volatility, which he said makes them unsuitable for long-term value preservation.\n\n\n\nSTORY CONTINUES BELOW Don't miss another story. Subscribe to the Crypto Long & Short Newsletter today . See all newsletters Sign me up By signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy .\n\n“Second, our reserves need to be highly liquid so that they can be used quickly for monetary policy purposes if needed,” Schlegel told Tamedia before pointing to a lack of security inherent in being software-based assets. “We all know that software can have bugs and other weak points.”\n\n\n\nThe Swiss National Bank President’s words come amid a growing debate in Switzerland over the nascent asset class. A recent initiative is pushing for a constitutional amendment requiring the SNB to hold bitcoin in its reserves alongside gold, the article said.\n\n\n\nThe initiative, launched in December and led by entrepreneur Yves Bennaim, does not go into details when it comes to the bitcoin allocations but specifies it should be built up from the bank’s earnings. It has 18 months to collect 100,000 signatures in a bid to trigger a nationwide vote on the topic.\n\n\n\nDespite Switzerland’s growing acceptance of cryptocurrencies, with various Swiss banks offering customers cryptocurrency-related services, Schlegel dismissed the asset class as a “niche phenomenon.” Currencies, he told Tamedia, have already been in competition, and Schlegel maintained the bank is “not afraid of competition from cryptocurrencies,” citing the continued strength of the Swiss franc.",
          "link": "https://www.coindesk.com/markets/2025/03/01/swiss-national-bank-president-reportedly-dismisses-bitcoin-as-reserve-asset",
          "published": "2025-03-01T18:31:14"
        },
        {
          "title": "BTC ETFs Finally Snap Eight-Day $3.2B Outflow Streak With $94.3M Inflows",
          "text": "Spot bitcoin exchange-traded funds (ETFs) in the U.S. saw $94.3 million of total inflows on the last day of February as crypto's worst month in three years came to an end.\n\nSTORY CONTINUES BELOW Don't miss another story. Subscribe to the Crypto Long & Short Newsletter today . See all newsletters Sign me up By signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy .\n\nThe figure capped an eight-day streak of outflow during which investors pulled over $3.2 billion from these funds as digital asset prices fell.\n\nBlackRock’s iShares Bitcoin Trust (IBIT), the largest spot bitcoin ETF by assets under management, was one of the outliers that saw $244.6 million in outflows on Friday. Meanwhile, other large ETFs, including Fidelity’s FBTC, brought in $176 million from investors, while the ARK 21Shares Bitcoin ETF saw the largest inflows, bringing in $193.7 million, according to Farside Investors data.\n\nBitcoin ETF flow data (Farside)\n\nThe inflows came as the cryptocurrency market started showing signs of recovery after the price of bitcoin hit a $78,000 low in the early hours of Feb. 28. Bitcoin is now trading around $84,900 after rising 1.6% in the last 24 hours, while the broader CoinDesk 20 Index rose 0.3% to 2,705.\n\nOver the past week, BTC is still down by roughly 12%, while the broader crypto market, as measured by the CoinDesk 20 Index, fell by 15.8%. Spot bitcoin ETFs had been enduring a significant outflow streak since Feb. 14, a day in which these funds saw $66.2 million inflows.\n\n\n\nSpot ether ETFs, on the other hand, have maintained an ongoing outflow streak on the last day of February, with $41.9 million leaving these funds. Since their last day with a positive net flow, $357.5 million exited these funds, according to data from Farside.\n\nThe recent market recovery comes as the White House announced that U.S. President Donald Trump will host a crypto summit on March 7 and after the world’s largest asset manager, BlackRock, added a 1% to 2% allocation of its spot bitcoin ETF to one of its model portfolios.\n\nRead more: BlackRock's Bitcoin ETF Sees Record Daily Outflow as the Basis Trade Starts to Unwind",
          "link": "https://www.coindesk.com/markets/2025/03/01/bitcoin-etfs-finally-snap-eight-day-usd3-2b-outflow-streak-with-usd94-3m-inflows",
          "published": "2025-03-01T17:02:55"
        }
      ]
    },
    "cointelegraph": {
      "rss": "https://cointelegraph.com/rss",
      "link": "https://cointelegraph.com/",
      "articles": [
        {
          "title": "Our current data infrastructure threatens DeFi’s future",
          "text": "Opinion by: Maxim Legg, founder and CEO of Pangea\n\nThe blockchain industry faces a crisis of its own making. While we celebrate theoretical transaction speeds and tout decentralization, our data infrastructure remains firmly rooted in 1970s technology. If a 20-second load time would doom a Web2 app, why are we settling for that in Web3?\n\nWith 53% of users abandoning websites after just three seconds of load time, our industry’s acceptance of these delays is an existential threat to adoption.\n\nSlow transactions are not merely a user experience problem. High-performance chains like Aptos are capable of thousands of transactions per second. Yet, we are trying to access their data through “Frankenstein Indexers” — systems cobbled together from tools like Postgres and Kafka that were never designed for blockchain’s unique demands.\n\nThe hidden cost of technical debt\n\nThe consequences extend far beyond simple delays. Current indexing solutions force development teams into an impossible choice: either build custom infrastructure (consuming up to 90% of development resources) or accept the severe limitations of existing tools. That creates a performance paradox: The faster our blockchains get, the more apparent our data infrastructure bottleneck becomes.\n\nIn real-world conditions, when a market maker needs to execute a crosschain arbitrage trade, they are essentially fighting against their own infrastructure, in addition to competing against other traders. Every millisecond spent polling nodes or waiting for state updates represents missed opportunities and lost revenue.\n\nThis is no longer theoretical. Major trading firms currently operate hundreds of nodes just to maintain competitive reaction times. The infrastructure bottleneck becomes a critical failure point when the market demands peak performance.\n\nTraditional automated market makers might work for low-volume token pairs, but they are fundamentally inadequate for institutional-scale trading.\n\nMost blockchain indexers today are better described as data aggregators that build simplified views of chain state that work for basic use cases but fall apart under severe load. This approach might have sufficed for the first-generation DeFi applications, but it becomes entirely inadequate when dealing with real-time state changes across multiple high-performance chains.\n\nRethinking data architecture\n\nThe solution requires fundamentally rethinking how we handle blockchain data. Next-generation systems must push data directly to users instead of centralizing access through traditional database architectures, enabling local processing for true low-latency performance. Every data point needs verifiable provenance, with timestamps and proofs ensuring reliability while reducing manipulation risks.\n\nA fundamental shift is underway. Complex financial products like derivatives become possible onchain with faster blockchains and lower gas fees. Furthermore, derivatives are used for price discovery, which currently happens on centralized exchanges. As chains get quicker and cheaper, derivatives protocols will become the primary venue for price discovery.\n\nRecent: The role of stablecoins and RWAs in DeFi\n\nThis transition demands infrastructure capable of delivering data “within the blink of an eye” — between 100 to 150 milliseconds. This is not arbitrary. It is the threshold where human perception notices delay. Anything slower fundamentally limits what is possible in decentralized finance.\n\nThe imminent convergence of market forces\n\nThe current model of excessive node polling and inconsistent latency profiles will not scale for serious financial applications. We are already seeing this with significant trading firms building increasingly complex custom solutions — a clear signal that existing infrastructure is not meeting market needs.\n\nAs faster blockchains with lower gas fees enable sophisticated financial instruments, the ability to stream state changes in real time becomes critical for market efficiency. The current model of aggregating data with multi-second delays fundamentally limits what is possible in decentralized finance.\n\nEmerging blockchains are pushing data throughput to unprecedented levels. Without matching advances in data infrastructure, we will have created Ferrari engines connected to bicycle wheels — all the power with no ability to use it effectively.\n\nThe imperative for change\n\nThe market will force this change. Those who fail to adapt will find themselves increasingly irrelevant in an ecosystem where real-time data access is not just a luxury but a fundamental necessity for participation.\n\nOpinion by: Maxim Legg, founder and CEO of Pangea\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.",
          "link": "https://cointelegraph.com/news/the-future-of-de-fi-is-at-risk?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "published": "2025-03-02T15:00:00"
        },
        {
          "title": "Here’s what happened in crypto today",
          "text": "Today in crypto, Bitcoin’s growing active addresses may signal an incoming turning point for the crypto market after the latest correction, the Ethereum Foundation announced new leadership, and US President Donald Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulations, stablecoins and Bitcoin reserve legislation.\n\nRising Bitcoin activity hints at market bottom, potential reversal\n\nBitcoin active addresses are nearing a three-month high, signaling a potential crypto market capitulation that may stage a price reversal from the latest correction.\n\nActive addresses on the Bitcoin network surged to over 912,300 on Feb. 28, a level not seen since Dec. 16, 2024, when Bitcoin (BTC) traded for around $105,000, Glassnode data shows.\n\nBitcoin number of active addresses. Source: Glassnode\n\nThe surge in active addresses may signal a “capitulation moment” for the crypto market, according to crypto intelligence platform IntoTheBlock. The firm noted in a Feb. 28 post on X:\n\n“Historically, spikes in on-chain activity have often coincided with market peaks and bottoms—driven by panic sellers exiting and opportunistic buyers.”\n\n“While no single metric guarantees a price reversal, this surge suggests the market could be at a crucial turning point,” the post added.\n\nIn financial markets, capitulation refers to investors selling their positions in a panic, leading to a significant price decline and signaling an imminent market bottom before the start of the next uptrend.\n\nEthereum Foundation selects two individuals to lead organization\n\nThe Ethereum Foundation announced new leadership on March 1, appointing longtime Ethereum developer Hsiao-Wei Wang and Nethermind CEO Tomasz Stańczak as co-directors of the organization.\n\nWang has seven years of experience as a core researcher at the Foundation and Stańczak grew Nethermind from a small project into one of Ethereum's largest execution clients and a global company.\n\nAccording to the Ethereum Foundation’s announcement, both individuals will assume their roles as co-directors on March 17.\n\nWang pictured left and Stańczak pictured right. Source: The Ethereum Foundation\n\n“This marks an exciting new chapter in the Foundation’s evolution as we continue to support a growing Ethereum ecosystem,” spokespeople for the Foundation added.\n\nThe change comes during a challenging time for the Ethereum ecosystem and struggling Ether (ETH) prices as investors and the Ethereum community call for a change in direction.\n\nTrump to host first White House crypto summit on March 7\n\nUS President Donald Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulatory policies, stablecoin oversight, and the potential role of Bitcoin in the US financial system.\n\nThe attendees will include “prominent founders, CEOs, and investors from the crypto industry,” along with members of the President’s Working Group on Digital Assets, according to an announcement shared by the White House “AI and crypto czar,” David Sacks, in a March 1 X post.\n\nThe summit will be chaired by Sacks and administered by Bo Hines, the executive director of the Working Group.\n\nSacks was appointed White House Crypto and AI and Czar on Dec. 6, 2024, to “work on a legal framework so the Crypto industry has the clarity it has been asking for, and can thrive in the U.S.,” Trump wrote in the announcement.",
          "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "published": "2025-03-02T13:25:14"
        },
        {
          "title": "Solana down 45% since Trump token launch as memecoins divert liquidity",
          "text": "Solana’s price continues to struggle under pressure from the growing memecoin market despite showing resilience following its largest-ever token unlock.\n\nSolana (SOL) fell over 45% since the Official Trump (TRUMP) memecoin was launched, from over $261 on Jan. 18 to $143 on March 2, TradingView data shows.\n\nThe growing investor appetite for memecoins may be limiting Solana’s price performance, according to Dan Hughes, founder of the decentralized finance platform Radix.\n\nMemecoins “don’t tend to draw in much external capital flow; instead existing eco-system capital “round-robins” from one meme to the next,” Hughes told Cointelegraph, adding:\n\n\n\n“Even in the case of TRUMP, most of the inbound liquidity was outflow from other crypto assets, people selling their crypto portfolio to buy TRUMP in extreme FOMO [fear of missing out].”\n\n“You can see the effect in the market, where for a few days everything was red except TRUMP and Solana, and it was amusingly labeled the liquidity vampire,” he added.\n\n\n\nSOL/USDT, 3-month chart. Source: Cointelegraph/TradingView\n\nMemecoins may be attracting a significant share of the newly entering liquidity from Solana. Circle minted over $8.75 billion worth of USDC (USDC) since Jan. 1, according to Lookonchain, yet Solana’s price fell over 24% despite the new liquidity.\n\nRelated: Wintermute withdraws $38M SOL from Binance ahead of $2B Solana unlock\n\nStill, Solana’s price managed to recover above $140 despite experiencing a $2-billion token unlock, which released over 11.2 million SOL tokens into circulation on March 1 as the biggest token unlock for Solana.\n\nIndustry watchers were concerned about a significant downside move for SOL since a large amount of the unlocked tokens were purchased at $64 per SOL in FTX’s auctions by firms such as Galaxy Digital, Pantera Capital and Figure.\n\nRelated: Binance is not ‘dumping’ Solana and other token holdings — Spokesperson\n\nMacro events, rug pulls are limiting institutional crypto investment\n\nExternal macroeconomic factors and recent security incidents also continue limiting the upside of the crypto market, said Hughes, adding:\n\n“Events on the world stage are having a greater impact than in previous cycles. A much larger ratio of invested capital is institutional, who are much more cautious, having to consider a wider set of markets, factors and variables when making decisions [...].”\n\n“Couple that with the exhaustion of continued rug-pulls, hacks, losses, it will take some time for the remaining dust to settle and the mojo to come back,” he said.\n\nInvestor sentiment is still recovering from the $1.4 billion Bybit hack, which occurred on Feb. 21, marking the largest hack in crypto history.\n\nMagazine: ETH whale’s wild $6.8M ‘mind control’ claims, Bitcoin power thefts: Asia Express",
          "link": "https://cointelegraph.com/news/solana-falls-45-trump-token-launch-memecoin-disappointment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "published": "2025-03-02T13:14:41"
        },
        {
          "title": "Ethereum’s Pectra upgrade could lay groundwork for next market rally",
          "text": "Ethereum’s highly anticipated Pectra upgrade could set the stage for the next phase of the 2025 crypto market cycle, according to analysts, even as Ether continues to underperform Bitcoin.\n\nThe Ether (ETH) price fell over 32% during February, finding a local bottom at an over two-month low of $2,073 before recovering to the current $2,245 mark, Cointelegraph Markets Pro data shows.\n\nETH/USD, 1-year chart. Source: Cointelegraph\n\nEthereum’s upcoming Pectra upgrade, scheduled for March 5, could help ease long-term selling pressure, according to Gabriel Halm, a research analyst at blockchain intelligence firm IntoTheBlock:\n\n“While Ethereum’s upcoming Pectra upgrade won’t necessarily trigger an instant price bump, it marks a significant step forward in the ongoing improvements to the Ethereum ecosystem. By reducing consensus overhead and boosting L2 scalability, it will expand the network’s overall capacity, thereby enhancing its competitive edge.”\n\nAdditionally, Ethereum Improvement Proposal (EIP)-7251 will increase the validator staking limit from 32 ETH to 2,048 ETH, making it easier for validators to compound their earnings, potentially reducing sell pressure over time.\n\nRelated: Can Ether recover above $3K after Bybit’s massive $1.4B hack?\n\nEther’s over 32% monthly correction may signal that ETH price is setting up for the next leg up based on fractal patterns from the 2017 cycle shared by popular crypto trader Merlijn The Trader in a March 1 X post.\n\nIn crypto trading, technical traders use price fractal patterns to identify key support and resistance levels and potential trend reversals based on historical data.\n\nRelated: Ethereum developer Danny Ryan joins Etherealize as co-founder\n\nEthereum Foundation announces leadership shift\n\nEthereum’s price struggles have coincided with months of criticism from community members, who claim the network is losing direction due to competition from high-throughput chains and layer-2 solutions cannibalizing the mainnet.\n\nFollowing the widespread complaints, the Ethereum Foundation announced a new leadership structure consisting of two co-directors of the Foundation, Hsiao-Wei Wang — a core researcher at the Ethereum Foundation, and Tomasz Stańczak, the CEO of Nethermind — one of the largest execution clients on Ethereum.\n\nAccording to the March 1 announcement, Wang has seven years of experience as a researcher at the Ethereum Foundation, and Stańczak has proven leadership in scaling an organization from an early-stage project to a global company.\n\nWang and Stańczak will assume their roles as co-directors of the Foundation on March 17.\n\nThe leadership change comes amid growing fears that the network’s layer-2 scaling solutions are cannibalizing Ethereum, and competition from new, high-throughput chains all erode investor confidence.\n\nTo address these concerns, Vitalik Buterin outlined a strategy to strengthen Ethereum in a Jan. 23 blog post, which included increasing the blob count, thereby increasing transaction capacity and encouraging layer-2 solutions to pay a percentage of their fees to the base layer.\n\nMagazine: Ethereum L2s will be interoperable ‘within months’: Complete guide",
          "link": "https://cointelegraph.com/news/ethereum-pectra-next-eth-price-catalyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "published": "2025-03-02T12:03:22"
        }
      ]
    },
    "cnn_business": {
      "rss": "http://rss.cnn.com/rss/money_news_international.rss",
      "link": "https://www.cnn.com/business",
      "articles": [
        {
          "title": "Mexico ready to retaliate by hurting American corn farmers",
          "text": "Mexico is ready to hit the U.S. where it hurts: Corn.\n\nMexico is one of the top buyers of American corn in the world today. And Mexican senator Armando Rios Piter, who leads a congressional committee on foreign relations, says he will introduce a bill this week where Mexico will buy corn from Brazil and Argentina instead of the United States.\n\nIt's one of the first signs of potential concrete action from Mexico in response to President Trump's threats against the country.\n\n\"I'm going to send a bill for the corn that we are buying in the Midwest and...change to Brazil or Argentina,\" Rios Piter, 43, told told CNN's Leyla Santiago on Sunday at an anti-Trump protest in Mexico City.\n\nHe added: It's a \"good way to tell them that this hostile relationship has consequences, hope that it changes.\"\n\nAmerican corn goes into a lot of the country's food. In Mexico City, from fine dining restaurants to taco stands on the street, corn-based favorites like tacos can be found everywhere.\n\nRelated: Mexican farmer's daughter: NAFTA destroyed us\n\nAmerica is also the world's largest producer and exporter of corn. American corn shipments to Mexico have catapulted since NAFTA, a free trade deal signed between Mexico, America and Canada.\n\nAmerican farmers sent $2.4 billion of corn to Mexico in 2015, the most recent year of available data. In 1995, the year after NAFTA became law, corn exports to Mexico were a mere $391 million.\n\nExperts say such a bill would be very costly to U.S. farmers.\n\n\"If we do indeed see a trade war where Mexico starts buying from Brazil...we're going to see it affect the corn market and ripple out to the rest of the ag economy,\" says Darin Newsom, senior analyst at DTN, an agricultural management firm.\n\nRios Piter's bill is another sign of Mexico's willingness to respond to Trump's threats. Trump wants to make Mexico pay for a wall on the border, and he's threatened taxes on Mexican imports ranging from 20% to 35%.\n\nTrump also wants to renegotiate NAFTA. He blames it for a flood of manufacturing jobs to Mexico. A nonpartisan congressional research report found that not to be true.\n\nRelated: Mexico doubles down on Trump 'contingency plan'\n\nStill, Trump says he wants a better trade deal for the American worker -- though he hasn't said what a better deal looks like.\n\nAll sides signaled two weeks ago that negotiations would begin in May after a 90-day consultation period.\n\nBut Trump says if negotiations don't bear the deal he wants, he threatens to withdraw from NAFTA.\n\nSuch tough talk isn't received well by Mexican leaders like Rios Piter. He's not alone. Mexico's economy minister, Ildefonso Guajardo, said in January Mexico would respond \"immediately\" to any tariffs from Trump.\n\n\"It's very clear that we have to be prepared to immediately be able to neutralize the impact of a measure of that nature,\" Guajardo said Jan. 13 on a Mexican news show.\n\n--Shasta Darlington contributed reporting to this story",
          "link": "http://money.cnn.com/2017/02/13/news/economy/mexico-trump-us-corn/index.html?section=money_news_international",
          "published": "2017-02-13T17:37:06"
        },
        {
          "title": "Swiss voters reject corporate tax overhaul",
          "text": "Voters in Switzerland have shocked the political establishment by rejecting a reform plan that would have brought the country's corporate tax system in line with international norms.\n\nThe tax reforms, which were widely supported by the business community, would have removed a set of special low-tax privileges that had encouraged many multinational companies to set up shop in Switzerland.\n\nExperts say the future of Switzerland's tax system is now unclear. The vote result could create headaches for firms that had been banking on their implementation, and deter companies who had been considering a move to the country.\n\n\"They do not know what [tax] measures will be available... That is not a very solid basis for making investment decisions,\" Peter Uebelhart, head of tax at KPMG in Switzerland, said in a video statement.\n\nSwitzerland has come under intense pressure from G20 and OECD nations in recent years to clean up its tax system. The country runs the risk of being \"blacklisted\" by other nations if it doesn't change its tax system by 2019.\n\nMany voters rejected the tax reform package over fears it might reduce the amount of revenue collected by the government, according to Stefan Kuhn, head of corporate tax at KPMG in Switzerland. That might have lead to tax hikes on the middle class.\n\nThe current tax system gives preferential treatment to some companies with large foreign operations. International tax authorities say the rules amount to unfair corporate subsidies.\n\nMartin Naville, head of the Swiss-American Chamber of Commerce, said it's possible that voters didn't understand the complexities of the reforms. The measures were rejected by 59% of voters.\n\n\"I think it's a very bad day for Switzerland,\" Naville said. \"Clearly, the uncertainty and the credibility in the Swiss [system] has taken a massive hit.\"\n\nRelated: How Europe's elections could be hacked\n\nSwiss authorities say they will move quickly to create a modified tax reform proposal. Naville said he hopes new rules are devised within the next few months.\n\n\"All stakeholders now have to take responsibility to develop an acceptable competitive tax system, and to regain credibility regarding the famed political stability which gave Switzerland such an advantageous position,\" he said in a statement.\n\nNaville hinted that potential tax reforms in the U.S. and U.K. could tempt Swiss-based companies to relocate, putting more pressure on Switzerland's tax base.",
          "link": "http://money.cnn.com/2017/02/13/pf/taxes/switzerland-tax-referendum-vote/index.html?section=money_news_international",
          "published": "2017-02-13T15:45:35"
        }
      ]
    },
    "financial_times": {
      "rss": "https://www.ft.com/rss/home",
      "link": "https://www.ft.com/",
      "articles": [
        {
          "title": "Putin ally pushes deal to restart Nord Stream 2 with US backing",
          "text": "Try unlimited access Only $1 for 4 weeks\n\nThen $75 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.",
          "link": "https://www.ft.com/content/dc9c51ab-03cb-47ba-ad0a-09c4deed9b50",
          "published": "2025-03-02T05:00:06"
        },
        {
          "title": "Sacking of Iran’s finance minister deals blow to reformists",
          "text": "Try unlimited access Only $1 for 4 weeks\n\nThen $75 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.",
          "link": "https://www.ft.com/content/ea69af86-7e46-46ea-a64a-466dcaf0b3a3",
          "published": "2025-03-02T14:06:42"
        }
      ]
    },
    "forbes": {
      "rss": "https://www.forbes.com/investing/feed/",
      "link": "https://www.forbes.com/investing/",
      "articles": []
    },
    "fox_business": {
      "rss": "http://feeds.foxnews.com/foxnews/business",
      "link": "https://www.foxbusiness.com/",
      "articles": []
    },
    "marketwatch": {
      "rss": "https://www.marketwatch.com/rss",
      "link": "https://www.marketwatch.com/",
      "articles": []
    },
    "morningstar": {
      "rss": "https://www.morningstar.com/rss",
      "link": "https://www.morningstar.com/",
      "articles": []
    },
    "nytimes_business": {
      "rss": "https://rss.nytimes.com/services/xml/rss/nyt/Business.xml",
      "link": "https://www.nytimes.com/section/business",
      "articles": [
        {
          "title": "What You Should Know About Your Spouse’s Money",
          "text": "Here’s a pop quiz for married couples.\n\nDo you know your spouse’s salary? What about the balance of your partner’s 401(k) — and credit card? Bonus points if you can cite how much your husband or wife thinks you need to live comfortably in retirement, or even what age he or she hopes that will happen.\n\nIf you’re like most married people, you’re sure you’ll ace this test. Nearly nine in 10 couples say they communicate well with their partner about money, and 94 percent say they are open and transparent with their better half about finances, according to studies released last year by the financial services companies Fidelity and Ameriprise.\n\nIn reality? Not so much.\n\nThe Fidelity survey found that more than a third of couples couldn’t correctly identify their partner’s salary within at least $25,000 of their actual pay. Over half disagreed about much they needed to save for retirement. Research shows similar disconnects among many couples when it comes to debt, net worth, savings and lifestyle goals.\n\nThat’s not even counting the outright secrets that about four in 10 married couples admit to keeping about money, according to a 2025 Bankrate survey. Leading the list of indiscretions: spending more than their partner would be OK with, followed by hiding debt, credit cards or savings accounts.",
          "link": "https://www.nytimes.com/2025/03/02/business/couples-personal-finances-retirement.html",
          "published": "2025-03-02T08:00:20"
        },
        {
          "title": "How Trump’s Tariffs Could Affect American Companies",
          "text": "From her home in Phoenix, Erica Campbell is waiting for a cargo vessel from China to deliver a shipment of thousands of Jesus rattle dolls, tin Easter eggs, religious-themed baby swaddle blankets and 15,000 packages of Jesus Heals bandages.\n\nMs. Campbell, 36, the owner of Be a Heart, a Catholic goods business, paid the Chinese factories that manufacture the items months ago. The boxes were loaded in a container before President Trump imposed a new 10 percent tariff on all Chinese imports on Feb. 1. She said she probably avoided paying an additional duty as a result, but she was worried there would be more U.S. tariffs to come.\n\n“I can’t figure out what is going to happen,” Ms. Campbell said. “I am on high alert.”",
          "link": "https://www.nytimes.com/2025/03/01/business/trump-tariffs-american-importers.html",
          "published": "2025-03-01T10:02:22"
        }
      ]
    },
    "reuters_markets": {
      "rss": "https://www.reutersagency.com/feed/?best-sectors=markets",
      "link": "https://www.reuters.com/markets/",
      "articles": []
    },
    "the_guardian_business": {
      "rss": "https://www.theguardian.com/uk/business/rss",
      "link": "https://www.theguardian.com/uk/business",
      "articles": [
        {
          "title": "From backwater to hotspot: how HS2 could bring £10bn economic boost to Old Oak Common",
          "text": "Overlooking one of Europe’s biggest building sites might not be every luxury apartment dweller’s ideal view, but at least one man is revelling in it.\n\nBelow the new 54-storey Icon Tower, Old Oak Common station is starting to take shape: the initial London hub of HS2, and the catalyst for the economic transformation of an unloved part of west London. According to Gary Sacks, the chief executive of the tower’s developer, City & Docklands, this is now “the capital’s new development hotspot”, vindicating the group’s foray west.\n\nWhile the delays and escalating budget of the high-speed rail project have been well documented, HS2 is keen to show that the story so far – even before any trains run – is not just bat-shed crazy costs, but sky-high benefits from the promise of better transport connections.\n\nNew research by consultancy Arcadis, commissioned by HS2 Ltd, claims that the mega-station at Old Oak Common will boost the local economy by £10bn over a decade – and has also turned the area into a new development hotspot for London.\n\nPlanning applications within a 1.5-mile radius from the site have risen by 22% since the first phase of HS2 was confirmed in legislation in 2017. That is not an unusual figure for London – but the value of those applications far exceeds comparable areas such as Ealing and Wembley, coming in at a cumulative £3.4bn – more than four times higher than the preceding seven-year period.\n\nArcadis’s analysis projects that HS2 will help bring 22,000 homes and nearly 19,000 new jobs to the Old Oak Common area, including hi-tech jobs and roles in the creative industries, boosting average pay.\n\nWhile Euston is planned to succeed Old Oak Common station as HS2’s London terminus, the new west London station, with 14 platforms and fast connections, is likely to be the more impressive hub for many years. As well as HS2, it will boast a stop on the Great Western mainline railway, Heathrow Express, and the Elizabeth line.\n\nHS2’s new chief executive, Mark Wild, has promised to reset the troubled programme, having previously managed Crossrail to a restated timeline and budget to open as the Elizabeth line in 2022.\n\nWild will unveil Arcadis’s research with a first public speech this week, in an attempt to rekindle enthusiasm in the positive potential of Britain’s biggest infrastructure scheme, which was again criticised last week in a parliamentary report as a “casebook example of how not to run a major project”. The estimated budget for even the truncated HS2 is now as high as £80bn in today’s prices, the public accounts committee said, with huge uncertainty over the fate of Euston at one end and how the railway will accommodate the service on the West Coast mainline north of Birmingham at the other.\n\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Railway workers and trains at Old Oak Common in west London. Photograph: Victoria Jones/PA\n\nWild said: “HS2 is designed to increase capacity on Britain’s railways and kickstart growth in the British economy. This research shows how HS2 is doing just that – boosting economic prosperity locally around HS2’s Old Oak Common station – years before the first trains leave HS2’s platforms.\n\n“It underlines the vital importance of the work I’m now undertaking to reset HS2 and ensure that this railway is efficiently delivered for the lowest reasonable cost to maximise the benefit to the taxpayer.”\n\nAround Old Oak, Imperial College has snapped up sites including the Victoria Park industrial estate for science and tech developments, while Garden Studios at Park Royal has established a high-end TV production presence since 2021. The studio’s chief executive, Thomas Hoegh, has set out high hopes for it to become the “the media tech village of Europe”, adding: “We see the contours of that today but the reality of that is going to come when HS2 is done.”\n\nSacks, whose new tower is the tallest residential development in London outside Canary Wharf, believes he is capitalising on new transport connections in the way others already have from the Elizabeth line: “The returns are going to outweigh the risks by a long way.”",
          "link": "https://www.theguardian.com/uk-news/2025/mar/02/from-backwater-to-hotspot-how-hs2-could-bring-10bn-economic-boost-to-old-oak-common",
          "published": "2025-03-02T13:23:54"
        },
        {
          "title": "The world has changed – it's time for a radical Labour rethink on the economy | Heather Stewart",
          "text": "Principled political resignations are rare at Westminster, so Anneliese Dodds’s departure on Friday, over Labour’s cuts in aid to fund defence spending, was a significant moment.\n\nIn her powerful resignation letter, Dodds rightly highlighted the heavy costs of the cuts for some of the world’s poorest people, compounding the damage caused by the Trump administration shutting US aid projects.\n\nBut she also shed light on the clash between neat fiscal rules and messy geopolitics that is likely to define the rest of Labour’s time in office.\n\nDodds was writing before Friday’s sinister show of petulance in the Oval Office. But it was already clear that the deepest cut in the UK aid budget in history would not mark the end of the matter.\n\nPresumably referring to debates in Germany and across the EU, where a common defence fund is under consideration, Dodds told Starmer she “expected we would collectively discuss our fiscal rules and approach to taxation, as other nations are doing”.\n\nWarning that defence spending may yet need to rise significantly further, Dodds added that this would be impossible through “tactical cuts to public spending”.\n\nInstead, she said, “these are unprecedented times, when strategic decisions for the sake of our country’s security cannot be ducked.”\n\nShe is correct: Starmer may have won the warm welcome he sought from Donald Trump for boosting defence spending, with his shameless raid on the development budget – a policy previously advocated by Reform and the Tory party – but if the US withdrawal from the European sphere sticks, the prime minister is likely to have to come back for more in the months and years ahead, and there are few soft spending targets left.\n\nLabour had boxed itself in tightly even before Trump began tearing up the transatlantic alliance. The narrow headroom Rachel Reeves left against her self-imposed fiscal rules, combined with a deteriorating economic outlook, meant the Treasury was already considering spending cuts in the 26 March statement.\n\nAnd the prospect of tough trade-offs in June’s spending review are already threatening Labour’s hopes of transforming threadbare public services – surely at the heart of the “change” the party promised voters.\n\nNow, with Trump’s intentions apparently clear – and little to show for Starmer’s smash-and-grab raid on the aid budget – it must be time for a radical rethink.\n\nThere is no doubt whatsoever that Labour has been dealt a historically bad hand. The Conservatives left it with legacy tax and spending plans that didn’t add up without heroic assumptions about future cuts to an already crumbling public sector.\n\nThe national debt is nudging 100% of GDP after the cost of the banking crisis and a decade of sluggish economic growth were compounded dramatically by the Covid pandemic.\n\nInterest rates, which were at rock bottom through much of the post-global financial crisis period before rising to 16-year highs in summer 2023, are on their way down but remain high by recent historical standards, and subject to the whims of volatile financial markets. None of this can be wished away.\n\nYet if Starmer is right that we are in “a world where everything has changed”, as he put it in his speech explaining the aid cuts, some much more creative thinking will be called for.\n\nThere were early signs of the flexibility required thisweekend as Reeves announced she would expand the remit of Labour’s national wealth fund (though not its budget) to encompass defence spending.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nBut the historic nature of the situation must mean that, in a phrase Starmer once used in opposition to bludgeon his own party towards backing a second Brexit referendum, “all options should be on the table”.\n\nPart of that may mean international discussions on seizing – rather than just freezing – Russian assets, as the foreign secretary, David Lammy, has suggested.\n\nThe UK’s new £2.26bn loan to Ukraine, announced by Reeves on Saturday, is part of a G7 initiative that involves earmarking the profits on these assets. Lammy’s proposal involves raiding the underlying capital, instead of leaving it intact.\n\nBut surely the rethink must also extend to considering alternative ways of raising the cash. That should include revisiting the pledge not to reverse Jeremy Hunt’s ill-advised cuts to national insurance contributions (NICs), as well as other options such as reforming the UK’s out-of-kilter council tax system, and looking afresh at wealth taxes.\n\nNo tax increases are likely to be popular – focus groups tell Labour strategists the public feel they’re paying quite enough already; and the vicious backlash from the farming inheritance tax changes, which raise just £500m or so, underlines how tough the politics can be.\n\nMeanwhile, Reeves’s £25bn increase in employer NICs – designed not to hit voters’ payslips directly – is continuing to cascade through the jobs market. Anyone with a child at a nursery or a relative in a care home will be getting a letter about now explaining why their fees are going up sharply.\n\nAgainst that backdrop, Labour will be reluctant to come back for more, and indeed Reeves has all but promised not to.\n\nBut the alternative, of four years of salami-slicing from public services and welfare budgets as the peace dividend evaporates, will have its own debilitating political impact.\n\nAnd the task of tooling up to join the EU in resisting Vladimir Putin coincides with another urgent generational challenge that cannot be ducked: investing to fit the economy for the transition away from fossil fuels, and protecting the poorest from the consequences.\n\nAs the extraordinary gathering of European leaders in London on Sunday makes clear, Starmer is quite right that the world has changed. Tax and spending policy as conceived by Labour in opposition will not meet the moment. All options must be on the table.",
          "link": "https://www.theguardian.com/business/2025/mar/02/the-world-has-changed-its-time-for-a-radical-labour-rethink-on-the-economy",
          "published": "2025-03-02T11:11:33"
        }
      ]
    },
    "the_wall_street_journal": {
      "rss": "https://feeds.a.dj.com/rss/RSSMarketsMain.xml",
      "link": "https://www.wsj.com/market-data",
      "articles": []
    },
    "washington_post_business": {
      "rss": "http://feeds.washingtonpost.com/rss/business",
      "link": "https://www.washingtonpost.com/business/",
      "articles": []
    },
    "yahoo_finance": {
      "rss": "https://www.yahoo.com/news/rss/business",
      "link": "https://finance.yahoo.com/",
      "articles": [
        {
          "title": "Why Nvidia (NVDA) Stock Was Climbing On Friday",
          "text": "Nvidia (NVDA) stock advanced on Friday as buyers rushed in to purchase oversold stocks. NVDA stock initially declined after the chip maker reported stronger-than-expected fourth-quarter results and provided 2025 sales guidance that was also above analysts' average estimate.\n\nMorgan Stanley viewed the company's Q4 results favorably and kept an Overweight rating on the shares.\n\nWhy Nvidia (NVDA) Stock Is Declining Again Today\n\nThe Highlights of NVDA's Q4 Results and Guidance\n\nNVDA's Q4 sales surged 78% versus the same period a year earlier to $39.33 billion, versus analysts' average estimate of $38.16 billion. The company's earnings per share came in at 89 cents, compared with the mean outlook of 85 cents.\n\nNVDA CFO Colette Kress reported that the revenue from the company's new chip, Blackwell, came in at $11 billion last quarter, beating the company's expectations.\n\nOn the guidance front, the tech giant expects Q1 sales of $43 billion, plus or minus 2%. Analysts' average estimate was $42.05 billion.\n\nNvidia's Comments\n\nThe company's revenue from data centers more than doubled year-over-year last quarter, Kress noted.\n\n\"Sequential growth in our Data Center revenue was strongest in the U.S....We expect a significant ramp of Blackwell in Q1,\" she stated.\n\nMorgan Stanley Remains Bullish on NVDA Stock\n\nEven though NVidia is still transitioning from its Hopper line of graphic processor units (GPUs) to Blackwell, the chip maker managed to increase its sales by 185 in Q4 versus Q3 and surpass its sales guidance by almost $2 billion, Morgan Stanley noted. The investment bank raised its price target on the name to $163 from $152 and kept an Overweight rating on the shares.\n\nWhile we acknowledge the potential of NVDA as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: 20 Best AI Stock To Buy Now and Complete List of All AI Companies Under $2 Billion Market Cap. Disclosure: None. This article is originally published at Insider Monkey.",
          "link": "https://finance.yahoo.com/news/why-nvidia-nvda-stock-climbing-151605861.html",
          "published": "2025-03-02T15:16:05"
        },
        {
          "title": "How Palantir Can Justify Its Valuation Over The Next Few Years",
          "text": "Do you believe that trees can grow to the sky? Well, apparently the market has been pricing Palantir (NASDAQ:PLTR) stock this way, with the company trading at valuation multiples that go far beyond what we could consider excessively expensive.\n\nEven though Palantir's trajectory, especially over the last two years, has been impressive (to say the least), many investors may be thinking that the 345% growth over the last twelve months could indicate that the robust growth and improvement in fundamentals are already priced into the stock. The fact is, Palantir in 2025 will still be the leading pure AI player in the software segment, capturing demand in a way that no other company has been able to match.\n\nBecause of this, the demand for Palantir's software services has been highly unpredictable, more likely to still be in its early innings, as the AI revolution still has a massive space to fill, especially in software offerings yet to be developed. Other companies will come, but for now, Palantir is best positioned to capture this demand. For this reason, analysts have been consistently revising projections upwards with each quarter reported by Palantir, and this will likely continue to drive the stock upwards.\n\nBecause of this, I still see 2025 as a great opportunity to buy Palantir, even at such valuations.\n\nBefore diving deeper into the Palantir thesis, for those not familiar with what the company actually does, it was founded in 2003 with the mission to build data-driven operations and decision-making software. Its early focus was primarily on intelligence and defense, working across national security contexts. As such, much of its software legacy was informed by the kind of learnings in those front-line deployment settings.\n\nAt the moment, Palantir operates across different industries, in various locations both within and outside of government, in the commercial sector, and also in non-profit sectors. The company primarily operates with three software platforms, which are:\n\nApollo , responsible for deploying and managing complex software footprints across many different environments, allowing developers to write code that works with all cloud services.\n\nFoundry , which does the same as Gotham but on the commercial side to cut costs, enhance efficiency, and create new productsintegrating with other data platforms like Snowflake, Azure, and AWS.\n\nGotham , which is their operating system for intelligence and defense, designed to integrate all the data into one platform and use it for decision-making and mission planning in high-stakes environments like the battlefield.\n\nStory Continues\n\nPalantir also launched its Artificial Intelligence Platform (AIP) in 2023, which allowed businesses to integrate AI models into their virtual twins and instruct those models. This way, businesses can now create AI agents that can perform any task in real time. This was (and still is) revolutionary within the software space, and it has been the main driver for the company's commercial business, which has been booming and taking the company to a whole new level, such as its inclusion in the S&P 500 in 2024.\n\nPalantir As The Greatest Software Name on AI\n\nAll the work done by Palantir over the past few years has been at the heart of the AI revolution. According to the company's CEO, Alex Karp, The world is in the midst of a U.S.-driven AI revolution that is reshaping industries and economies, and we are at the center of it.\n\nIts commercial business has been able to handle and analyze very large, complex, and often unstructured data from a variety of sources. And arguably, there is no other software company that has managed to do this as well as Palantir at the moment.\n\nAs a result, Palantir's business growth has been breathtaking, with companies turning to AI solutions generating an unwavering demand for the company's software. Let's look at the evolution of the company's revenues over the past five years. From 2019 to 2023, Palantir's revenues grew from $742.6 million to $2.86 billion, marking a staggering CAGR of 29.6%.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nWhen we look at the company's top-line performance over the last five quarters, closely capitalizing on the recent demand for AI, revenues grew from 13% to 36% between Q2 2023 and Q4 2024. Much of this acceleration is obviously connected to the enormous competitive advantages of Palantir's commercial business. In Q4 2024 alone, revenues grew by 64% year-over-year and 20% quarter-over-quarter in Q3.\n\nA SaaS Juggernaut on Growth and Profitability\n\nBecause it is a software company experiencing ultra-high demand for its services, Palantir has been able to balance growth and profitability exceptionally well. Starting with the most recent quarter, Q4 2024, the company generated the largest profit in its twenty-year history, reaching $165 million in net income.\n\nArguably, the company's management has been doing a great job of entering new business, securing deals, and streamlining expenses. For example, in Q4 2024, the U.S. commercial customer count was 382, a 43% increase from the same period in 2023.\n\nBut what stands out to me the most is that, typically, when a company is experiencing rapid revenue growth, operating margins are affected. But this doesn't seem to be the case for Palantir. As recent numbers show, the company grew revenues by 36% in Q4, while operating margins grew to 39%, up from 37% in Q2.\n\nTo highlight this, let's look at an interesting metric: the Rule of 40. Essentially, this rule involves calculating the sum of a SaaS (Software-as-a-Service) company's revenue growth rate and profit margin, which should be at least 40%. As the percentage moves above or below this threshold, investors can determine whether a SaaS company is effectively managing its expansion while maintaining financial sustainability, as both extremesrapid growth at the cost of profits or high profitability with slow growthcan be problematic.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nSource: Palantir's IR's\n\nPalantir's latest data on the Rule of 40 stands at 81%, an improvement from the 68% reported in Q2 2024 and the mere 38% reported in Q2 2023. To get an idea of how relevant this metric is, observe the chart below to see how Palantir has outperformed all the major software giants in the fourth quarter, even achieving operating margins higher than Microsoft.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nSource: Company's filings, author.\n\nIt's worth noting here that, although these companies have lower scores than Palantir for various reasons, achieving higher scores every quarter is an increasingly difficult task, as this involves sustaining very high growth rates at very high operating margins. The vast majority tend to excel in one area, not both. The projection, however, is that from Q1 2025 onwards, Palantir will deliver revenue growth of 37.8%, gradually decreasing to 34% in Q2 2025 and 31.2% in Q3 2025. On the other hand, EPS growth rates are expected to continue growing by 61% in Q1 2025, and slowly decline to 47.1%and 39.4% in Q2 2025 and Q3 2025, respectively.\n\nEven so, assuming that operating margins decline to the mid-30s and revenues grow in the mid-20s, Palantir would still have a Rule of 40 largely above the benchmark and most other software giants.\n\nValuation, the Key Topic of Debate\n\nFinally, although it is quite evident the exceptional growth of Palantir and the marked improvement of its fundamentals each quarter, arguably, many investors struggle to digest the multiples the market is paying due to all the expectations surrounding Palantir.\n\nPalantir is trading at a Price-to-Sales (P/S) multiple of 71x over the last twelve months, and 56x for 2025. Considering market projections that sales could reach $4.79 billion in 2026, Palantir would still be trading at a 44x forward P/S. Microsoft, for example, the top software company in the world, trades at a P/S of 12.4x, and 8.6x in Fiscal 2027.\n\nBut let's now look at it in terms of the bottom line, particularly adjusted for growth. Palantir is trading at a forward P/E ratio of 162.8x, where forecasts suggest an EPS CAGR of 25.6% for the next three to five years, resulting in a PEG ratio of 6.3xalmost more than six times that of Nvidia (NVDA).\n\nClearly, it is very difficult to justify such multiples based on these metrics, and arguably, Excel spreadsheets modeling future growth can be highly inaccurate for a company in such a rapid growth stage, where it is clear that demand is still far from stabilizing.\n\nOne example of this is that every quarter, Palantir has revised its guidance upward, clearly indicating that even the company cannot predict how far it can go.\n\nAs this continues, and should continue for at least the next few quarters, analysts will constantly update their projections upward, which should continue to support the stock trading higher, even though extremely stretched valuations are already pricing in perfection. Over the last six months, analysts have revised the majority of projections up by double digits until 2033.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nSource: GuruFocus\n\nBut let's try, through a reverse DCF model, to create some bull, bear, and base cases for Palantir to try to determine what growth metrics the company would need to achieve to justify its highly debated valuations.\n\nLet's start with the bear case.\n\nCurrently, analysts project Palantir to achieve revenue growth at a 5-year CAGR of 34.7%. Let's assume that growth comes slightly below that, at a 33% CAGR over this period. Then, Palantir reported operating margins of 39% in Q4 2024. Since Palantir is in its early growth stages, let's assume a 5% operating margin CAGR, maintaining an average over the next five years unchanged.\n\nI will also assume, based on the last twelve months, a tax rate of 4.3%, D&A to CapEx of 188%, and a CapEx percentage of 0.4% of revenue. For changes in net working capital, I will conservatively assume zero. I'll assume a discount rate (WACC) of 10%, conservative given the volatility of a growth stock like Palantir. Also, a long-term growth rate of 3%, in line with GDP growth.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nSource: Author, GuruFocus and SA data.\n\nIn this case, we would arrive at an implied value of just $25.51 per share for Palantir stock, meaning about a 72% downside if Palantir reports a 5-year revenue CAGR of 34.7% and 5% operating margin CAGR over the same period.\n\nNow, let's move to the base case.\n\nLet's assume that Palantir manages to grow revenue at a 39% CAGR over the next five years, and operating margins grow at a 10% CAGR over the same period. I will assume the same metrics for the tax rate, CapEx, and D&A, as well as the long-term growth rate from the bear case as a standard. However, I will account for a WACC of 9%, slightly less conservative, and changes in net working capital at 5%, as the company is seeing significant growth in sales and it's estimated that there could be fluctuations in receivables or payables.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nSource: Author, GuruFocus and SA data.\n\nIn this scenario, we arrive at an implied market price of $48 per share, a 47% downside.\n\nFinally, let's look at the bull case, or what growth rates Palantir would need to achieve to reach its current share price.\n\nLet's assume a 5-year revenue CAGR of 44% and EBIT margins growing at a 15% 5-year CAGR. Unlike the bear and base cases, we will assume a change in NWC of 10% per year and a less conservative WACC of 8%.\n\nHow Palantir Can Justify Its Valuation Over The Next Few Years\n\nSource: Author, GuruFocus and SA data.\n\nUnder this scenario, we would have an implied share price of $90.99 per share, essentially in line with the latest share price.\n\nAlthough this exercise is highly speculative, it provides a dimension of the growth rates Palantir would need to achieve over the next five years to simply justify its current share price. But of course, one thing is what the company is intrinsically worth, and another is what the market is willing to pay. Clearly, companies uniquely positioned to capitalize more robustly than their peers on secular growth trends deserve a premium.\n\nEven in this exercise, considering a base case indicating Palantir is about 47% overvalued, we could argue that this may be a reasonable premium for a company that keeps revising its guidance upward each quarter, where there are no signs of demand cooling for its services, which are increasingly resulting in margin synergies.\n\nThe Bottom Line\n\nI don't believe that trees can grow to the sky, but as long as Palantir shows no signs of its demand cooling down, the journey of its stock towards the sky should continue triumphantly. Thus, being at the center of the AI revolution within one of the most robust margin segments in the world (software), valuations are just a detail, which for now, shouldn't be an obstacle to seeing Palantir reach new peaks throughout 2025.\n\nThis article first appeared on GuruFocus.\n\n",
          "link": "https://finance.yahoo.com/news/palantir-justify-valuation-over-next-151549976.html",
          "published": "2025-03-02T15:15:49"
        },
        {
          "title": "Getting a Tax Refund? 3 Oil Stocks to Buy With Your Refund Check.",
          "text": "The average American receives a tax refund of $3,138. That's a big windfall for most people. They could use that money to go on a nice vacation, pay down some of their debt, or invest for the future.\n\nOne place to consider investing your tax refund is the oil patch. While the sector can be volatile, there are some great oil stocks to consider buying these days. TotalEnergies (NYSE: TTE), ExxonMobil (NYSE: XOM), and Chevron (NYSE: CVX) stand out to some Fool.com contributors as the top ones to buy right now because they have the fuel to potentially grow your tax refund into a much bigger future windfall.\n\nTotalEnergies is oil...and more\n\nReuben Gregg Brewer (TotalEnergies): One long-term trend that investors in the energy sector have to contend with is the increasing use of clean energy. That's not to suggest that oil and natural gas are going away; that's far from the case, as an \"all of the above\" approach appears to be the way forward. But the big growth in the energy sector has been in areas like solar and wind. What's an investor to do with the dichotomy between slow-growing carbon fuel businesses and faster-growing renewable energy? Punt with TotalEnergies.\n\nTotalEnergies is one of the largest integrated energy companies on the planet. It will continue to supply the world with the carbon fuel it needs for as long as it is profitable to do so. But unlike most of its integrated energy peers, TotalEnergies has made a material commitment to cleaner energy options via its integrated power division.\n\nThis business grew 17% in 2024. Profit-wise, it is hard to compare integrated power to TotalEnergies' oil and gas operations, which all shrank in 2024, since commodity prices make those divisions fairly volatile. The real takeaway is that management is preparing today for a future in which cleaner energy sources have a more important role in the global energy landscape.\n\nThis matters because it means you can comfortably own TotalEnergies and collect its 5.8% dividend yield without worrying that the energy transition is leaving you behind. Better yet, profits from carbon fuels are effectively powering TotalEnergies' business shift. So, you are benefiting today from carbon fuels and using those same profits to benefit from what is likely to be a future with more clean energy in it.\n\nThe best of the best\n\nMatt DiLallo (ExxonMobil): ExxonMobil is the undisputed leader in the oil patch. Last year, the company produced $34 billion in earnings and $55 billion in cash flow from operations. That marked its third-best year in a decade and led all international oil companies (IOCs).\n\nStory Continues\n\nWhat's even more impressive is how fast it's growing. Over the past five years, Exxon has grown its earnings at a roughly 30% annualized rate while increasing its cash flow at a 15% yearly pace. That hasn't just led its peer group; it has grown nearly four times faster than leading large-cap industrial companies in the S&P 500. The keys to Exxon's success boil down to two factors: structural cost savings and high-return investments. Since 2019, Exxon has reduced its structural costs by more than $12 billion by simplifying business processes, optimizing supply chains, and modernizing its technology. Meanwhile, the company has invested heavily in expanding its best assets, which are generating high returns on capital employed (13% last year and 11% on average over the past five years). Exxon plans to continue executing its strategy over the coming years. By 2030, the company estimates it can add $20 billion in earnings and $30 billion in cash flow. It also expects to capture an additional $7 billion in cost savings over the next six years. In addition, it plans to invest about $140 billion in major projects and its Permian Basin development program to fuel earnings growth. This outlook positions the company to produce $165 billion in cumulative excess free cash flow to continue increasing its dividend (an industry-leading 42 straight years) and buy back stock. ExxonMobil has delivered peer-leading total returns over the past five years. Given the growth still ahead, it seems likely to continue growing shareholder value in the future. A no-brainer oil stock to own Neha Chamaria (Chevron): Chevron is among the world's largest oil and gas companies and the second-largest publicly listed energy stock in the U.S. It is also one of the best dividend oil stocks out there and is on solid footing right now, having delivered record production and returned record cash to its shareholders in 2024. Chevron expects to grow production at a compound annual growth rate of around 6% through 2026. The company's focus, however, is on two things right now: costs and an impending acquisition. Chevron expects to cut costs by $2 billion to $3 billion by 2026 and reportedly intends to reduce its global workforce by up to 20%, according to Reuters. The company is also consolidating all its businesses into two broad segments: (1) upstream and downstream and (2) midstream and chemicals. Management believes the reorganization will improve efficiency and deliver more value for its shareholders. The biggest catalyst, however, would be the acquisition of Hess. Chevron agreed to acquire Hess in an all-stock deal worth $53 billion to gain access to its massive oil project in Guyana, but arbitration proceedings have stalled the deal. Chevron, however, is confident the acquisition will go through now that it has cleared the Federal Trade Commission's antitrust review. Even without Hess, Chevron expects to grow its free cash flow (FCF) by an average annual rate of at least 10% through 2026, which should also support bigger dividends. Chevron's size, growth potential, and 37-year record of dividend increases make it one of the few no-brainer oil stocks to buy right now. Don’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this. On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves: Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $323,920 !*\n\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $45,851 !*\n\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $528,808!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon. Continue » *Stock Advisor returns as of February 24, 2025 Matt DiLallo has positions in Chevron. Neha Chamaria has no position in any of the stocks mentioned. Reuben Gregg Brewer has positions in TotalEnergies. The Motley Fool has positions in and recommends Chevron. The Motley Fool has a disclosure policy. Getting a Tax Refund? 3 Oil Stocks to Buy With Your Refund Check. was originally published by The Motley Fool",
          "link": "https://finance.yahoo.com/news/getting-tax-refund-3-oil-151400707.html",
          "published": "2025-03-02T15:14:00"
        }
      ]
    },
    "CNBC": {
      "rss": "https://www.cnbc.com/id/10000664/device/rss/rss.html",
      "link": "cnbc.com",
      "articles": [
        {
          "title": "Another 'near miss': Citigroup mistakenly credited a customer account with $81 trillion",
          "text": "Citigroup mistakenly credited a customer's account with $81 trillion last year when it meant to send just $280.\n\nThe payment, which took place last April, was missed by two employees but caught 90 minutes after it was posted, the Financial Times first reported Friday. It was reversed several hours later and reported to the Federal Reserve and Office of the Comptroller of the Currency as a \"near miss.\"\n\nThe event is the latest mistake disclosed by the Wall Street bank, which is struggling to overcome a series of operational errors in recent years.\n\n\"Despite the fact that a payment of this size could not actually have been executed, our detective controls promptly identified the inputting error between two Citi ledger accounts, and we reversed the entry,\" Citi said in a statement to NBC News. \"Our preventative controls would have also stopped any funds leaving the bank. While there was no impact to the bank or our client, the episode underscores our continued efforts to continue eliminating manual processes and automating controls through our Transformation.\"\n\nCiti neither confirmed nor provided comment on the number of near misses it has experienced.\n\nNear misses occur when a bank processes the wrong amount but is able to recover the funds. The bank suffered 10 near misses of $1 billion or more last year and 13 in the year prior, the according to the report.\n\nThe bank has been working to repair its reputation since it sent $900 million in error to creditors engaged in a contentious battle over the debt of cosmetics group Revlon five years ago — which led to the ousting of former CEO Michael Corbat, as well as big fines and regulatory consent orders requiring Citi to fix the issues.\n\nCorbat's successor, Jane Fraser, has said improving risk and controls is a top priority. The bank was still fined $136 million by regulators last year for not making enough progress on the improvements.",
          "link": "https://www.cnbc.com/2025/03/01/citigroup-mistakenly-credited-a-customer-account-with-81-trillion.html",
          "published": "2025-03-01T20:39:49"
        },
        {
          "title": "Trump administration, Musk’s DOGE plan to fire nearly all CFPB staff and wind down agency, employees say",
          "text": "Elon Musk holds up a chainsaw onstage during the Conservative Political Action Conference (CPAC) in National Harbor, Maryland, U.S., February 20, 2025.\n\nThe Consumer Financial Protection Bureau's Trump-appointed leadership plans to fire nearly all its 1,700 employees while \"winding down\" the agency, according to testimony from employees.\n\nIn a trove of statements released late Thursday, federal employees said that the mass layoff was discussed in meetings they attended this month with senior CFPB leaders and members of Elon Musk's so-called Department of Government Efficiency.\n\n\"My team was directed to assist with terminating the vast majority of CFPB employees as quickly as possible,\" said an employee identified as Alex Doe, a pseudonym used out of fear of retaliation.\n\nDoe said the plan from CFPB leaders and DOGE was to cut the bureau's workforce in three phases. It would first eliminate probationary and term employees, then carry out a wave of about 1,200 layoffs, leaving a skeleton crew of a few hundred workers.\n\n\"Finally, the Bureau would 'reduce altogether' within 60-90 days by terminating most of its remaining staff,\" Doe said.\n\nThe workers' testimony comes at a crucial time for the CFPB, the agency created to protect consumers after the 2008 financial crisis caused by irresponsible lending. Since DOGE operatives first arrived at the CFPB this month, the bureau has shuttered its Washington headquarters, initiated the first round of layoffs and told those who remain to stop nearly all work.\n\nThe department has also reversed course on several cases where it accused financial firms including Capital One of ripping off customers, dismissing at least four cases Thursday involving billions of dollars in alleged consumer harm.\n\nThe filings containing the employee statements were made in the case started by a CFPB union, which led to a judge suspending acting Director Russell Vought's moves to shutter the bureau. After the CFPB fired about 200 probationary and term employees, the agency's actions were put on hold until a March 3 hearing.",
          "link": "https://www.cnbc.com/2025/02/28/cfpb-leaders-and-elon-musk-doge-planned-to-fire-nearly-all-staff.html",
          "published": "2025-02-28T17:39:02"
        },
        {
          "title": "Senators grill Trump’s CFPB director pick: You are 'on the Titanic, good luck’",
          "text": "Jonathan McKernan, U.S. President Donald Trump's nominee to be the director of the Consumer Financial Protection Bureau, sits on the day he testifies during a Senate Banking, Housing and Urban Affairs Committee confirmation hearing on Capitol Hill in Washington, D.C., U.S., February 27, 2025.\n\nPresident Donald Trump's pick to lead the Consumer Financial Protection Bureau on Thursday withstood grilling from Democrat senators who repeatedly asked him to confirm that he would uphold his legal obligations to run the agency.\n\nPressed by senators including Elizabeth Warren of Massachusetts, Jonathan McKernan, a former Federal Deposit Insurance Corporation board member, told lawmakers he would \"fully and faithfully\" enforce laws related to the CFPB's mission.\n\n\"My legal career started just as the 2008 financial crisis was beginning,\" McKernan said. \"Watching that crisis unfold left me with an enduring conviction that we must have a financial regulatory system that works for everyday Americans. Consumer protection is critical to that end.\"\n\nStill, McKernan made it clear that he disagreed with how predecessor Rohit Chopra ran the agency. In opening remarks, he said that the CFPB \"acted in a politicized manner,\" exceeded its legal authority, hurt consumers by inadvertently raising prices and suffered from a \"crisis of legitimacy.\"\n\n\"This must be corrected if the CFPB is to reliably do what it's supposed to do: look out for the American consumer,\" said McKernan, a former corporate banking lawyer and Senate aide.\n\nSince acting CFPB Director Russell Vought took over this month, the agency has shuttered its Washington headquarters, fired about 200 employees and told those who remain to stop nearly all work. Those moves, along with an allegation from a CFPB union that Vought intends to fire more than 95% of the agency's staff, has spurred fears that the agency faces extinction.\n\nEarlier Thursday, the CFPB dismissed at least four enforcement lawsuits, including actions against Capital One and a Berkshire Hathaway unit.",
          "link": "https://www.cnbc.com/2025/02/27/senators-grill-trump-cfpb-pick-jonathan-mckernan.html",
          "published": "2025-02-27T21:20:41"
        },
        {
          "title": "Consumer Financial Protection Bureau drops lawsuits against Capital One and Berkshire, Rocket Cos. units",
          "text": "Russell Vought, director of the Office of Management and Budget (OMB) nominee for US President Donald Trump, during a Senate Budget Committee confirmation hearing in Washington, DC, US, on Wednesday, Jan. 22, 2025.\n\nThe Consumer Financial Protection Bureau's new leadership on Thursday dismissed at least four enforcement lawsuits undertaken by the previous administration's director.\n\nIn legal filings, the CFPB issued a notice of voluntary dismissal for cases involving Capital One ; Berkshire Hathaway-owned Vanderbilt Mortgage & Finance; a Rocket Cos . unit called Rocket Homes Real Estate; and a loan servicer named Pennsylvania Higher Education Assistance Agency.\n\n\"The Plaintiff, the Consumer Financial Protection Bureau, dismisses with prejudice this action against all Defendants,\" the agency said in the Capital One case. It used similar language in the other cases.\n\nThe moves are the latest sign of the abrupt shift at the agency since acting CFPB Director Russell Vought took over this month. In conjunction with Elon Musk's Department of Government Efficiency, the CFPB has shuttered its Washington headquarters, fired about 200 employees and told those who remain to stop nearly all work.\n\nUnder former Director Rohit Chopra, the CFPB accused Capital One of bilking customers out of more than $2 billion in interest; it said Vanderbilt ignored signs that customers couldn't afford its mortgages; it accused Rocket of providing illegal kickbacks to real estate agents; and it said that loan servicer Pennsylvania Higher Education Assistance Agency improperly collected loans.\n\nA Capital One spokesman said the bank welcomed the dismissal of its case, which it \"strongly disputed.\"\n\nA spokesman for Rocket also lauded the news: \"Rocket Homes has always connected buyers with top-performing agents based only on objective criteria like how well they helped homebuyers achieve their dream of homeownership. We are proud to put this matter behind us.\"\n\nShares of Capital One and Rocket climbed after the dismissals.",
          "link": "https://www.cnbc.com/2025/02/27/cfpb-drops-capital-one-rocket-mortgage-affiliate-lawsuits.html",
          "published": "2025-02-28T20:02:59"
        }
      ]
    },
    "Yahoo Finance": {
      "rss": "https://finance.yahoo.com/news/rssindex",
      "link": "finance.yahoo.com",
      "articles": [
        {
          "title": "The CFPB just dropped a bunch of its own lawsuits as the agency's future hangs in limbo",
          "text": "The Consumer Financial Protection Bureau (CFPB) abruptly dropped five of its own lawsuits against companies it had accused of victimizing customers on Thursday as the political and legal battle over the Trump administration’s efforts to radically downsize the agency raged on.\n\nThe abandoned cases included actions against major corporate names such as Capital One Financial, the country’s ninth-largest bank, and the real estate referral site Rocket Homes. Others targeted a major student loan servicer and a pair of consumer lenders.\n\nActivity at the CFPB has been largely frozen thanks to a stop-work order by Trump officials, who appear to be targeting the watchdog for potentially crippling cuts. Last week, it dismissed a case against the online lender SoLo Funds, raising concerns among Democrats and consumer advocates that the administration might begin unwinding much of the agency’s legal docket.\n\n“There are certainly indications that they intend to dismiss a large number of cases, if not all cases,” said Eric Halperin, who resigned as the CFPB’s head of enforcement earlier this month after serving in the Biden administration. He noted that the agency had canceled its contracts with expert witnesses, who are essential to proving cases in court, while its work stoppage has made it impossible to move suits forward.\n\nCFPB lawyers did not explain their decision to drop the cases in their court filings, and the agency did not respond to a request for comment. All five cases were dismissed with prejudice, meaning they could not be revived in the future.\n\nThe moves are in some ways unprecedented for the agency. Until this month, the CFPB had only ever dismissed one of its own lawsuits without first obtaining some sort of relief for consumers, former officials told Yahoo Finance. That occurred under the first Trump administration in 2018, when then-acting Director Mick Mulvaney ended a suit against the payday lender Golden Valley Lending. The case, however, was dismissed without prejudice, meaning it could have, in theory, been brought again.\n\nSeveral of the suits that the CFPB moved to end on Thursday were filed under former Director Rohit Chopra after Trump’s November election victory. The regulator sued Rocket Homes in December, alleging it had illegally provided real estate agents with kickbacks in order to steer customers toward its sister lender, Rocket Mortgage. In early January, it sued Berkshire Hathaway-owned Vanderbilt Mortgage & Finance, a mobile home lender it accused of illegally trapping customers in loans they couldn’t afford to pay.\n\nStory Continues",
          "link": "https://finance.yahoo.com/news/the-cfpb-just-dropped-a-bunch-of-its-own-lawsuits-as-the-agencys-future-hangs-in-limbo-214153537.html",
          "published": "2025-02-27T21:41:53"
        },
        {
          "title": "How Wall Street pros are looking at fears over a US economy slowdown",
          "text": "A choppy February for investors was punctuated by a poor reading on consumer confidence, a soft report on consumer spending, and a sell-off across many of the momentum trades that had defined the market action this year.\n\n\"The fear here among a lot of investors now [has] become that the economy could be slowing down faster than the Fed is willing to react, which is a tough situation,\" Steve Sosnick, chief strategist at Interactive Brokers, told Yahoo Finance an interview on Friday.\n\nFor the month, the tech-heavy Nasdaq Composite (^IXIC) fell about 4% while the S&P 500 (^GSPC) and Dow Jones Industrial Average (^DJI) were down 1.4%.\n\nNasdaq GIDS - Delayed Quote • USD (^IXIC) View Quote Details 18,847.28 - +(1.63%) At close: February 28 at 5:15:59 PM EST ^IXIC ^DJI ^GSPC Advanced Chart\n\nSosnick noted that in recent days, the Dow has been the best relative performer among the major US stock indexes given its lower weighting towards the tech and momentum names that play a larger role in its peer indexes the S&P 500 and Nasdaq.\n\nConsequently, defensive plays like Consumer Staples (XLP) have a more prominent influence on the Dow than the S&P 500.\n\n\"This is an environment either to lighten up [on stocks], raise a little cash, which, considering the cash is still paying you 4%, is not a terrible place to be,\" Sosnick said. \"But if you want to stay invested, you may want to move a bit more toward low beta stocks and high dividend stocks because they're a little more insulated from the market's risk off mentality right now.\"\n\nLow beta stocks tend to trade with less volatility than the average stock in the market, either going up or down less when the market moves one way or another.\n\nStreet signs hang outside the New York Stock Exchange (NYSE) at Wall Street in New York on February 3, 2025. (Photo by ANGELA WEISS / AFP) (Photo by ANGELA WEISS/AFP via Getty Images) · ANGELA WEISS via Getty Images\n\n'A lot of the winners are now being punted'\n\nWhether this market is being shaken by fears over economic growth — or is just seeing a rotation as investors move away from recent winners — is a debate that looks set to define the final month of the first quarter.\n\n\"The stock market is in the midst of another growth scare, in our opinion,\" Ed Yardeni and Eric Wallerstein at Yardeni Research wrote in a recent note. \"The latest batch of economic indicators has been weak. The current growth scare is reminiscent of last summer's scare.\"\n\nThat sell-off saw the S&P 500 fall just less than 10% peak-to-trough before the index recovered to make new all-time highs by November.\n\nNeil Dutta, head of economics at Renaissance Macro, warned in a recent note to clients that the economy does appear to be softening, with the Federal Reserve's decision to keep rates elevated amounting to a \"passive tightening of monetary policy [that] is the dominant risk and that has important implications for financial market investors.\"\n\nStory Continues\n\nIn Dutta's view, however, these are not yet the dynamics driving the recent action in markets. \"A lot of the winners are now being punted,\" Dutta told Yahoo Finance in an interview on Friday. \"You know, if it was a real recession story, you'd expect financial stocks to be underperforming. You wouldn't see Europe outperforming. There's a lot of things going on that are not really consistent with the growth scare.\" Should investors begin to act more forcefully on these signs that the economy is softening, Dutta also sees a change in how investors position their portfolios. \"If you have a massive tightening of monetary policy, that will put further downward pressure on economic growth and should push investors to take more defensive positions in the equity markets, in my opinion, that might mean Consumer Staples (XLP), maybe Utilities (XLU),\" Dutta said. \"I'm not an equity market strategist, but that's that's sort of how I'd be thinking about it,\" he added. \"And [I'd also expect investors] to take long positions in the Treasury market because, ultimately, I think the Fed will do the right thing, but there could be some pressure between now and then.\" Click here for in-depth analysis of the latest stock market news and events moving stock prices Read the latest financial and business news from Yahoo Finance",
          "link": "https://finance.yahoo.com/news/how-wall-street-pros-are-looking-at-fears-over-a-us-economy-slowdown-140006327.html",
          "published": "2025-03-02T14:00:06"
        },
        {
          "title": "Where Will AMD Stock Be in 5 Years?",
          "text": "The past five years have been fruitful for Advanced Micro Devices (NASDAQ: AMD) investors, as an investment of $1,000 made in the stock half a decade ago is now worth almost $2,200 as of this writing.\n\nHowever, to put things in perspective, the 118% jump in AMD's shares in the last five years is lower than the 178% jump clocked by the PHLX Semiconductor Sector index over the same period. The past year has been especially difficult for AMD investors, as the stock has shed 41% of its value during this period. This big drop can be attributed to AMD's inability to capitalize on the booming demand for artificial intelligence (AI) chips, a market where arch-rival Nvidia has established a dominant position.\n\nBut then, AMD's recent results have been solid, and the company has more than one catalyst that could help revive its stock market fortunes over the next five years. We are going to take a closer look at AMD's potential growth drivers and check why it may be a good idea to buy and hold this stock for the next five years.\n\nWhy the past five years have been a mixed one for AMD\n\nAMD's financial performance over the past five years has been mixed. While the company's revenue and earnings increased in 2020, 2021, and 2022 on account of strong sales of its central processing units (CPUs) and graphics cards used in personal computers (PCs), its bottom line growth fizzled after a strong start.\n\nThat's because the demand for PCs waned following strong sales in the years of the novel coronavirus pandemic. AMD was left with excess inventory on its hands, and it had to write it down, leading to a sharp decline in the company's earnings. Meanwhile, the company's data center business was in fine shape throughout this period as it continued gaining server CPU share from Intel.\n\nBut then, sales of gaming consoles from Sony and Microsoft, which are powered by AMD's semi-custom processors, started maturing and led those tech giants to place fewer orders. Throw in the fact that AMD is way behind Nvidia in the market for gaming graphics cards, with a share of just 10%; it is easy to see why the company's gaming business has been struggling for traction.\n\nSo, the mixed performance of AMD's various businesses has weighed on the stock's performance over the past five years. However, the good news is that all the segments discussed above are likely to enjoy solid growth over the next five years, paving the way for more upside in AMD stock.\n\nThese growth drivers could send this chipmaker higher in the next five years\n\nAMD's performance over the next five years will depend on the health of key segments such as gaming, data centers, and PCs. The good part is that all these business segments are likely to enjoy secular growth thanks to varied catalysts.\n\nStory Continues\n\nThe company's gaming business, for instance, should benefit from the arrival of new gaming consoles from Microsoft and Sony. The current console generation is close to five years old. A new one is likely to arrive within the next two to three years as both Sony and Microsoft have historically released a new generation of consoles every seven to eight years. Both Sony and Microsoft are expected to release their next-generation consoles in 2026 or 2027. That could give AMD's semi-custom chip business a nice boost as it has reportedly been selected by the console makers to supply the processors for their next-gen consoles. Moving from gaming to PCs, AMD has already started witnessing solid traction in this market. The company's client segment revenue increased by an impressive 52% in 2024 to a record $7.1 billion, thanks to \"strong demand for AMD Ryzen processors in desktop and mobile.\" The prospects of the PC market for the next five years appear to be bright due to the advent of generative AI. According to one estimate, the AI PC market's revenue is expected to jump by almost 5x between 2024 and 2030. This bodes well for AMD's long-term prospects, especially because the company has gained a larger PC processor market share. The chipmaker ended 2024 with almost 25% of the client CPU market under its control, up by almost five percentage points from the prior-year period, according to Mercury Research. Its revenue share of the client PC market grew at a faster rate, jumping 8.4 percentage points year over year. This points toward AMD's improving pricing power in the PC processor market, as its revenue share is improving at a faster pace than the unit share. Moreover, it won't be surprising to see AMD gaining more market share as arch-rival Intel isn't expected to launch a new desktop CPU until next year. As such, the stage seems set for healthy growth in AMD's gaming and PC segments over the next five years. At the same time, the company's data center business is also getting better, even though it is playing second fiddle to Nvidia in the AI GPU (graphics processing unit) market. AMD's data center revenue nearly doubled last year to a record $12.6 billion, driven by strong sales of both its server CPUs and GPUs. The company sold at least $5 billion worth of data center GPUs in 2024. AMD forecasts that its data center GPU business could grow to \"tens of billions, as we go through the next couple of years.\" In fact, AMD could clock solid revenue in data center GPUs over the long run, even if it manages to corner a small portion of this market for itself. In the end, it can be concluded that AMD seems set for outstanding earnings growth over the next five years. That's why buying this stock seems like a no-brainer right now, especially considering its price/earnings-to-growth ratio (PEG ratio) of just 0.42 based on its five-year projected earnings growth, according to Yahoo! Finance. A PEG ratio of less than 1 means that a stock is undervalued in light of the growth it is expected to deliver, and AMD is trading well below that threshold. So, investors looking to buy a growth stock that's trading at attractive levels can consider adding AMD to their portfolios. This stock looks positioned for impressive long-term upside. Don’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this. On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves: Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $323,920 !*\n\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $45,851 !*\n\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $528,808!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon. Continue » *Stock Advisor returns as of February 24, 2025 Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft, short February 2025 $27 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Where Will AMD Stock Be in 5 Years? was originally published by The Motley Fool",
          "link": "https://finance.yahoo.com/news/where-amd-stock-5-years-151900250.html",
          "published": "2025-03-01T15:19:00"
        }
      ]
    },
    "MarketWatch": {
      "rss": "https://www.marketwatch.com/rss/topstories",
      "link": "marketwatch.com",
      "articles": []
    },
    "Wall Street Journal": {
      "link": "wsj.com",
      "articles": [
        {
          "title": "Hiring Slows but Remains Solid, With Economy Adding 143,000 Jobs",
          "text": "The gain in jobs was lower than expected, but the job counts for November and December were revised upward by a combined 100,000.",
          "link": "https://www.wsj.com/economy/jobs/jobs-report-january-2025-unemployment-economy-1cb95d5b",
          "published": "2025-02-07T21:22:00Z"
        }
      ]
    }
  }
}