{
  "newspapers": {
    "bbc": {
      "rss": "http://feeds.bbci.co.uk/news/business/rss.xml",
      "link": "http://www.bbc.com/",
      "articles": [
        {
          "title": "Flat owner hit with £65,000 fire safety cladding bill as block too short for funding",
          "text": "Flat owner hit with £65,000 cladding bill as block too short for funding\n\n1 day ago Share Save Danielle Codd Business reporter Share Save\n\nBBC Tom says he worries constantly about how he's going to pay to make his building safe\n\nFlat owners are being hit with huge bills for fire safety work because their blocks are not tall enough to qualify for funding announced after the Grenfell Tower fire. The previous government launched the Building Safety Act after the 2017 fire which killed 72 people. But the rules do not apply to buildings under 11m (36ft) or five storeys high. Some lawyers claim the new law was \"rushed\" but the government says it covers the majority of leaseholders and it will continue to review the legislation. Paramedic Tom DeRonde received a £65,000 bill because his flat is in a three-storey building and says he faces bankruptcy.\n\n\"I had to take a month off work with stress. There's not been a day when I've not thought about cladding,\" he told the BBC. It is estimated there are 1.3 million leasehold flats in low-rise blocks, under 11m high in England, according to the End Our Cladding Scandal campaign. Tom bought his flat in Luton in 2018 with money he had saved from serving in the army. He said when he came home to a bill for £65,000 he was \"absolutely shocked\". The invoice from his landlord was his legal share of the costs to make the building fireproof. \"I thought it was a typo to be honest,\" said Tom. Then he learnt the building's height meant he was a \"non-qualifying leaseholder\" and would be liable to pay for fire safety work.\n\nTom climbed a ladder and measured his block of flats himself - it falls outside the protections of the law at 9m tall\n\n\"The government says for buildings under 11m, the risk can be mitigated by other means, like using fire alarms and sprinkler systems but in my case, that's not true,\" explained Tom. \"I've had two fire assessments both saying the cladding is dangerous and needs to be removed, and the price, which they also said would be lower for smaller buildings, is extortionate. I can't pay,\" he added. After complaining to the building's owners, Tom expects the bill to be reduced but is yet to find out by how much. Tom had planned to sell the flat to buy a family home but can't. \"It's ruining my life and I'm facing bankruptcy,\" he said. The Department for Housing told the BBC that owners of buildings under 11m should not pass on the costs of fixing historical safety defects to leaseholders. But the law does not prevent people like Tom being billed for unlimited amounts of money when the developers are no longer around or landlords cannot afford the remediation costs.\n\n'Falling through the gaps'\n\nLiz Ramsden is an expert in leasehold property at Knights and told the BBC she believes the Building Safety Act was drafted too quickly. \"The intention was that no leaseholder would have to pay but in reality we are finding a lot of leaseholders are having to pay huge sums of money. \"There was very little consultation and because of that we have these gaps in the legislation and people are falling through,\" she said. Even in buildings above 11m the rules fail to protect many leaseholders. Homeowners with Islamic mortgages or three or more properties also do not benefit from the full protections. This is something Martin Batty, who has an Islamic mortgage, only discovered when he put his one-bedroom flat up for sale. He said his lawyer explained the way Islamic home purchase plans are structured - to comply with Sharia law which does not allow paying interest - means he falls outside the scope of the act. \"It feels really unfair. I feel like I'm being discriminated against,\" he said.\n\nMartin Batty Martin Batty's Sharia mortgage on a leasehold flat means he's struggling to sell his property\n\n\"To find out that I'm a non-qualifying leaseholder just because I've got an Islamic home purchase plan is a huge kick in the teeth. It's really upsetting and is a huge let down.\" The government told the BBC Islamic interest free loans secured against properties were very rare. But Martin said he can't sell his flat because mortgage providers will not lend against it and solicitors won't advise on non-qualifying leases.\n\nSuzy and Colin outside their flats in Salford\n\nSuzy Spilling and her husband Colin invested in four rental properties to fund their retirement - including two flats in Salford \"mortgaged to the hilt\". These two flats are in a building where lots of the cladding has been found to be unsafe. The government will fund the removal but because the couple have more than three properties they too are non-qualifying leaseholders and will have to pay towards the costs of making the tower block fire-safe. \"Everything we have planned for would be out the window,\" said Suzy. \"How were we going to raise the funds needed? We could be on the hook for £100,000 for each of our two apartments.\" It is estimated there are 385,000 flats in England owned by non-qualifying leaseholders like Suzy and Colin, according to the End Our Cladding Scandal. The couple have gone back to work to save money \"but there's no way we're going to be able to cover the amount we're going to have to pay,\" she added. \"Our lives are on hold. We don't know when it's ever going to end.\"",
          "link": "https://www.bbc.com/news/articles/c14n6ngkrzeo",
          "published": "2025-02-28T22:28:05"
        }
      ]
    },
    "bloomberg": {
      "rss": "https://www.bloomberg.com/feed/podcast/bloomberg-businessweek",
      "link": "https://www.bloomberg.com/",
      "articles": []
    },
    "business_insider": {
      "rss": "https://www.businessinsider.com/rss",
      "link": "https://www.businessinsider.com/",
      "articles": [
        {
          "title": "The politics behind universal basic income",
          "text": "Universal basic income was once thought politically impossible. Then came Andrew Yang and COVID-19.\n\nBasic income programs are now gaining traction, offering payments to struggling families.\n\nMany Democrats and Republicans, however, are engaged in a political tug-of-war over the programs.\n\nWhile the idea of a universal basic income is gaining traction in the United States, the politics around it remain divided.\n\nA universal basic income is when the government cuts a check to the entire population — with no strings or limitations attached — to support (but not replace) their income.\n\nIt's not a new concept, but the feasibility of a universal basic income became more apparent during the pandemic when the government sent several payments to most of the population, known as \"stimulus checks.\" The idea has also been heavily promoted by tech industry leaders, who anticipate possible job losses with the onset of artificial intelligence. Outside the United States, there are already some countries with universal basic income and guaranteed basic income programs.\n\nWhile a national UBI program may still be a long way off in the United States, communities on the city and state levels have begun experimenting with a version called a guaranteed basic income.\n\nIn these programs, money is given to participants who comprise smaller population groups, like low-income people or mothers, for a limited time. Those residents can still spend the money however they want.\n\nEven these localized basic income programs, however, are coming up against political opposition.\n\nHere's a look at the politics driving the debate about universal and guaranteed basic income programs.\n\nThe rise of basic income programs\n\nIn the last decade, UBI has edged its way into the national vernacular.\n\nEntrepreneurs and tech executives like Elon Musk and Mark Zuckerberg voiced support for UBI in 2016 and 2017, respectively, citing the impact automation would have on the job force. Meanwhile, Joe Biden, then the vice president, wrote in 2017 that there was \"a better way forward\" than \"some type of guaranteed government check with no strings attached.\"\n\nDuring the 2020 presidential election campaign, Democratic candidate Andrew Yang, a tech entrepreneur, raised eyebrows when he proclaimed that, if elected, his administration would provide a universal basic income of $1,000 a month for every adult, a policy he called \"The Freedom Dividend.\" Yang said this was necessary to support American workers threatened by automation and inequality.\n\nAt the time, many dismissed Yang's predictions as a pipe dream at best and fear-mongering at worst. His candidacy quickly faded.\n\nAndrew Yang has been an advocate of universal basic income. AP Photo/Phil Long\n\nThen, a few years later, the COVID-19 pandemic forced most Americans home and many of them out of work. Suddenly, Yang's idea for a universal basic income became less outlandish.\n\n\"Certainly I never imagined that I would suspend my campaign in February and then we would agree to pay $1,000 a month to Americans in March,\" Yang told Politico in March 2020 after the Trump administration announced it intended to disperse stimulus checks.\n\nThe federal government, first under President Donald Trump and then President Joe Biden, sent three stimulus checks ranging from $600 to $1,400 for adults and additional payments for each child in a family. Over $800 billion in funds were disbursed from 2020 to 2021, lifting some 3 million children out of poverty.\n\nThe apparent success of the stimulus checks inspired advocacy groups and local and city governments to begin trying them on a smaller scale, giving rise to the numerous guaranteed basic income programs in the United States seen today.\n\nOne of the largest of these programs was funded in part by OpenAI CEO Sam Altman, who has advocated for some kind of basic income to alleviate the threat of artificial intelligence to US workers. The program distributed $1,000 a month to 1,000 people and $50 a month to another 2,000 (the control group) across multiple states over the course of three years.\n\nThose who received the cash payments reported \"greater agency to make decisions that worked best for their lives,\" including their living situations, healthcare decisions, and savings.\n\nRelated stories\n\nThe political challenges to basic income programs\n\nNot everyone, however, is on board with the small-scale basic income programs.\n\nBasic income programs are often accompanied by studies that examine their success. Many participants report improved housing and food security during the program and say they can find better jobs or pursue a higher level of education as a result.\n\nYet opposition to universal and guaranteed basic income has been fierce in some places. Post-pandemic, the resistance to UBI has been mostly spearheaded by Republicans, while Democrats have typically been among UBI's most ardent supporters.\n\nRepublicans who talk about the cons of universal basic income often mention the cost of running the programs and the precedent they set for workers. Some conservative lawmakers have criticized the programs as \"socialist\" handouts and expressed concern that they could discourage recipients from working.\n\nLast year, Republicans in Arizona voted to ban basic income programs in the state, and similar opposition efforts gained traction in Iowa, Texas, and South Dakota. Lawmakers in several states have argued that the checks, though distributed only for a limited time, would increase reliance on the government.\n\n\"This is socialism on steroids. This is a redistribution of wealth. This is an attack on American values,\" Iowa State Rep. Steve Holt said in 2024 while advocating for a statewide block to guaranteed basic income programs.\n\nSome critics also point to the targeted nature of the payments, some of which have been used to support specific populations based on race or identity.\n\nA conservative group last year sued to stop a San Francisco basic income program from sending payments to 55 vulnerable trans residents. The initiative accepted trans, nonbinary, gender nonconforming, and intersex applicants and prioritized those who are Black, Indigenous, or people of color. Judicial Watch, a conservative legal activist group, said in its lawsuit that the program violated the equal protection clause of the California constitution.\n\nAnother conservative lawsuit targeted the Abundant Birth Project, a basic-income program also in San Francisco that gave pregnant Black women $1,000 a month, calling it discriminatory because it used taxpayer money to provide the payments based on unlawful classifications, including race.",
          "link": "https://www.businessinsider.com/universal-basic-income-politics",
          "published": "2025-03-01T21:05:01"
        }
      ]
    },
    "cnbc": {
      "rss": "https://www.cnbc.com/id/10001147/device/rss/rss.html",
      "link": "https://www.cnbc.com/",
      "articles": [
        {
          "title": "How a $5 million fix turned Paramount Pictures' 'Sonic' into a billion-dollar franchise",
          "text": "In this article PARA Follow your favorite stocks CREATE FREE ACCOUNT\n\nParamount Pictures revamped version of Sonic the Hedgehog (r). Source: Paramount Pictures\n\nSonic the Hedgehog may be able to run faster than the speed of light, but his film franchise nearly came to a screaming halt in 2019. A less-than-three-minute trailer released early that year to tease the film's release, which was just six months away, was widely panned by fans who took to social media to rail against Paramount's character design. Dubbed \"Ugly Sonic,\" the blue creature that appeared on film was a far cry from the iconic video game speedster. Cinematic Sonic, version 1, had more realistic facial features, including human-like teeth, and his body proportions were deemed inconsistent with the character fans grew up with in the '90s. \"The trailer goes out, and I think it became the most viewed trailer in the history of Paramount Pictures. Which is amazing,\" said Toby Ascher, who acquired the rights to Sonic and produced the film franchise. \"The only problem was that 90% of people hated the trailer because of the design of Sonic.\" \"All of a sudden we went from trying really, really hard to make a really, really faithful video game adaptation to being next in line of the people who had ruined video games for everyone. It just was a disaster of epic proportions,\" Ascher added. The studio pivoted, opting to redesign the title character and push the film's release back three months to February 2020. The fix cost Paramount around $5 million but resulted in a franchise that has generated nearly $1.2 billion at the global box office. The studio hopes to build on that momentum with a fourth installment in the film franchise, set to debut in 2027. \"The Sonic franchise owes its box office success and longevity to a monumental decision early in the development of the first films' marketing campaign,\" said Paul Dergarabedian, senior media analyst at Comscore. \"A re-design of a main character is no small thing. ... These decisions can make or break what is every studio's dream of having a single film turn into a long-term revenue generating franchise. The return on investment by turning an 'ugly' Sonic into a beautiful revenue generating franchise is undeniable.\"\n\nBringing Sonic to the big screen\n\nAscher first acquired the rights to Sonic the Hedgehog in 2013, a time in Hollywood when video game-inspired films had failed to resonate with audiences. \"When we first started working on Sonic, making a video game adaptation was, like, a really bad idea,\" he told CNBC. No film based on a video game property had, to that point, managed to earn a positive rating from review aggregator Rotten Tomatoes. It wasn't until 2019 that a video game-based film generated a \"fresh\" rating on the site, indicating more than 60% positive reviews.\n\nBen Schwartz voices Sonic in Paramount Pictures' \"Sonic the Hedgehog.\" Paramount Pictures\n\n\"I don't think anyone in town really thought making a Sonic movie was a good idea,\" Ascher said. \"But, I think our strategy was that we had grown up with these games. We've grown up with these characters, and we wanted to treat them like any other character. We wanted to give them real emotional arcs, and real emotional stories where you could relate to them.\" Ascher noted that previous video game adaptations typically focused on worldbuilding rather than character development. \"What we've been able to do is inject into the franchise heart, and I think that that's what's made it different,\" said Neal Moritz, Ascher's producing partner and producer of franchises like \"The Fast and the Furious\" and \"21 Jump Street.\" Both Ascher and Moritz noted that while the filmmaking team behind the first \"Sonic the Hedgehog\" film overhauled the main character's design, the story remained pretty much the same.\n\n'We really screwed up'\n\nThe filmmaking team was blindsided by audiences' reactions to the first trailer, but were resolute in trying to resolve the issue rather than shelve the film or release it in its current form. Moritz said he made an \"impassioned speech\" to the heads of Paramount and Sega to allow the filmmakers to fix the mistake.\n\nParamount Pictures\n\nAs Moritz recalls, he told executives: \"We really screwed up here, but there's an incredible amount of interest and what we need to do is fix it ... We need some more money and we need some more time. If you give that to us, I think we could turn this thing around.\" \"I give both Paramount and Sega a lot of credit,\" Moritz said. \"They said 'OK.'\" In the redesign, the team brought back Sonic's iconic white gloves and classic red shoes. They reinfused the character with some of his cartoon roots, and six months after the first trailer, Paramount released a new iteration. \"The fans saw that we were trying to be really genuine in our love for this franchise,\" Ascher said, noting that in the wake of the first trailer the team began engaging more with fans and focus groups to drum up feedback and inspiration. The new trailer was well-received by fans, and three months later \"Sonic the Hedgehog\" opened to $58 million at the box office. The feature went on to collect $146 million domestically before the pandemic shuttered theaters. Globally, it pulled in $302 million.\n\nThe future of Sonic\n\nThe Sonic franchise has continued to thrive in the following years, with each follow-up feature outperforming the last. \"Sonic the Hedgehog 2\" snared $190 million domestically and $403 million globally, while \"Sonic the Hedgehog 3\" tallied $235 million stateside and $485 million worldwide. \"That's a big jump,\" said Marc Weinstock, Paramount's president of worldwide marketing and distribution. \"I get excited that every new movie does better than the last one, which is rare.\" Following the success of the second \"Sonic\" film, the studio's then-president and CEO of Paramount Pictures, Brian Robbins, greenlit a \"Knuckles\" series based on the franchise for the company's streaming service, Paramount+, as well as a third Sonic film. Sonic was becoming multi-platform, much like Robbins and Paramount had done for franchises like \"Teenage Mutant Ninja Turtles,\" \"A Quiet Place,\" \"Spongebob Squarepants\" and \"Paw Patrol.\" The \"Knuckles\" show generated more than 11 million global viewing hours in its first 28 days on Parmount+. The theatrical success also rocketed Sonic from a $70 million licensing business to one that generates more than $1 billion in retail revenue annually, according to Ivo Gerscovich, Sega's senior vice president and chief business and brand officer of Sonic the Hedgehog. \"The great thing about Sonic — and the success of Sonic from the very beginning — is that we basically have listened to the fans from day one,\" Robbins, now co-CEO of Paramount, said. \"The fans are fanatical about this franchise and love this franchise and know this franchise. Because of that, they've become really key in shaping the franchise ... They evangelize it.\"\n\nStill from Paramount's \"Sonic the Hedgehog 2.\" Paramount",
          "link": "https://www.cnbc.com/2025/03/01/paramount-sonic-fix-billion-dollar-franchise.html",
          "published": "2025-03-01T13:00:01"
        }
      ]
    },
    "coindesk": {
      "rss": "https://www.coindesk.com/arc/outboundfeeds/rss/",
      "link": "https://www.coindesk.com/",
      "articles": [
        {
          "title": "Ethereum Foundation Picks New Co-Executive Directors, Following Leadership Reshuffle",
          "text": "The Ethereum Foundation (EF), the non-profit organization that supports the development and research of the Ethereum blockchain, shared in a blog post on Saturday that they have selected Hsiao-Wei Wang and Tomasz Stańczak as their new co-executive directors.\n\nSTORY CONTINUES BELOW Don't miss another story. Subscribe to the The Protocol Newsletter today . See all newsletters Sign me up By signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy .\n\nThe news follows Tuesday’s announcement of Aya Miyaguchi leaving that role to become the EF’s new president. The leadership shake-up follows intense debate among the community about the EF’s role in the ecosystem, as some have blamed the organization and its leadership for the blockchain’s token ether (ETH) price lagging behind other cryptocurrencies, while the blockchain attracted for the first time less new developers than its competitor Solana.\n\nWang has been at the EF since 2017, where she helped do research on concepts like sharding, as well as contributed to Ethereum’s major overhaul known as “the Merge.” Stańczak founded Nerthermind, one of the largest software or clients that operate the Ethereum blockchain.\n\n“Over the next few years, the Ethereum ecosystem needs to navigate the challenging transition from being an early-stage project serving a small number of enthusiasts to being a robust permissionless censorship-resistant base layer of the global finance and software stack,” the Foundation said in their blog post.\n\nMore shuffling\n\nIn addition to Wang and Stańczak assuming their new roles, ex-EF researcher Danny Ryan shared that he would be joining Etherealize, the new project aimed at bringing ETH to Wall Street. The firm was founded by former banker Vivek Raman, who shared previously with CoinDesk that one of the goals of Etherealize is to bridge the gap between Ethereum and the banks by educating institutions and marketing ETH as a serious crypto asset.\n\nIn a post shared on X, Ryan said that he intends “to build a new Ethereum institution with Real World Ethereum as its north star.”\n\n“The world is ready to come on-chain, and we’re here to do the hard work necessary to make it happen,” Ryan added.\n\nRead more: Ethereum Foundation’s Aya Miyaguchi Leaving Executive Director Role\n\n\n\n",
          "link": "https://www.coindesk.com/tech/2025/03/01/ethereum-foundation-picks-new-co-executive-directors-following-leadership-reshuffle",
          "published": "2025-03-01T20:02:11"
        },
        {
          "title": "Swiss National Bank President Dismisses BTC as Reserve Asset",
          "text": "Swiss National Bank (SNB) President Martin Schlegel has rejected the idea of holding bitcoin as part of Switzerland’s central bank reserves, citing a lack of stability, liquidity, and security, according to local media.\n\n\n\nSpeaking to the Tamedia group, Schlegel cited three primary concerns surrounding cryptocurrencies. The first one is their volatility, which he said makes them unsuitable for long-term value preservation.\n\n\n\nSTORY CONTINUES BELOW Don't miss another story. Subscribe to the Crypto Long & Short Newsletter today . See all newsletters Sign me up By signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy .\n\n“Second, our reserves need to be highly liquid so that they can be used quickly for monetary policy purposes if needed,” Schlegel told Tamedia before pointing to a lack of security inherent in being software-based assets. “We all know that software can have bugs and other weak points.”\n\n\n\nThe Swiss National Bank President’s words come amid a growing debate in Switzerland over the nascent asset class. A recent initiative is pushing for a constitutional amendment requiring the SNB to hold bitcoin in its reserves alongside gold, the article said.\n\n\n\nThe initiative, launched in December and led by entrepreneur Yves Bennaim, does not go into details when it comes to the bitcoin allocations but specifies it should be built up from the bank’s earnings. It has 18 months to collect 100,000 signatures in a bid to trigger a nationwide vote on the topic.\n\n\n\nDespite Switzerland’s growing acceptance of cryptocurrencies, with various Swiss banks offering customers cryptocurrency-related services, Schlegel dismissed the asset class as a “niche phenomenon.” Currencies, he told Tamedia, have already been in competition, and Schlegel maintained the bank is “not afraid of competition from cryptocurrencies,” citing the continued strength of the Swiss franc.",
          "link": "https://www.coindesk.com/markets/2025/03/01/swiss-national-bank-president-reportedly-dismisses-bitcoin-as-reserve-asset",
          "published": "2025-03-01T19:45:42"
        }
      ]
    },
    "cointelegraph": {
      "rss": "https://cointelegraph.com/rss",
      "link": "https://cointelegraph.com/",
      "articles": [
        {
          "title": "Here’s what happened in crypto today",
          "text": "Today in crypto, the Ethereum Foundation announces new leadership, US President Donald Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulations, stablecoins and Bitcoin reserve legislation, and the Chicago Mercantile Exchange (CME) Group announced the launch of Solana futures contracts in March.\n\nEthereum Foundation selects two individuals to lead organization\n\nThe Ethereum Foundation announced new leadership on March 1, appointing longtime Ethereum developer Hsiao-Wei Wang and Nethermind CEO Tomasz Stańczak as co-directors of the organization.\n\nWang has seven years of experience as a core researcher at the Foundation and Stańczak grew Nethermind from a small project into one of Ethereum's largest execution clients and a global company.\n\nAccording to the Ethereum Foundation's announcement, both individuals will assume their roles as co-directors on March 17.\n\nWang pictured left and Stańczak pictured right. Source: The Ethereum Foundation\n\n\"This marks an exciting new chapter in the Foundation's evolution as we continue to support a growing Ethereum ecosystem,\" spokespeople for the Foundation added.\n\nThe change comes during a challenging time for the Ethereum ecosystem and struggling Ether (ETH) prices as investors and the Ethereum community call for a change in direction.\n\nTrump to host first White House crypto summit on March 7\n\nUS President Donald Trump will host the first White House Crypto Summit on March 7, bringing together industry leaders to discuss regulatory policies, stablecoin oversight, and the potential role of Bitcoin in the US financial system.\n\nThe attendees will include “prominent founders, CEOs, and investors from the crypto industry,” along with members of the President’s Working Group on Digital Assets, according to an announcement shared by the White House “AI and crypto czar,” David Sacks, in a March 1 X post.\n\nThe summit will be chaired by Sacks and administered by Bo Hines, the executive director of the Working Group.\n\nSacks was appointed White House Crypto and AI and Czar on Dec. 6, 2024, to “work on a legal framework so the Crypto industry has the clarity it has been asking for, and can thrive in the U.S.,” Trump wrote in the announcement.\n\nChicago Mercantile Exchange Group to launch Solana futures on March 17\n\nThe Chicago Mercantile Exchange (CME) Group, a globally recognized derivatives exchange, announced it will launch Solana (SOL) futures contracts on March 17, pending a review by United States financial regulators.\n\nAccording to the Feb. 28 announcement, market participants will have access to micro contracts of 25 SOL or standard contract sizes of 500 SOL, and all contracts will be cash-settled.\n\n\n\nCME Group already provides futures and options contracts for Bitcoin (BTC) and Ether (ETH) to investors looking to hedge against the highly volatile nature of these digital assets.\n\nThe addition of Solana futures contracts gives traditional finance investors additional exposure to the crypto markets and provides the crypto markets with fresh capital injections that should support prices.",
          "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "published": "2025-03-01T21:31:11"
        },
        {
          "title": "Ethereum developer Danny Ryan joins Etherealize as co-founder",
          "text": "Longtime Ethereum (ETH) developer Danny Ryan recently announced he is joining Etherealize — an organization responsible for marketing the Ethereum ecosystem to institutional investors — as a co-founder alongside Vivek Raman.\n\nRyan said he would complement Raman's focus on bridging the real world to Ethereum by bridging Ethereum back to the real world. The developer added:\n\n\"This sits at the confluence of real adoption, commonsense regulation, ecosystem development, and critical R&D across L1, L2, and the application layer. We plan to become an active player across the Ethereum sphere.\"\n\nThe announcement came amid sweeping leadership changes at the Ethereum Foundation — a separate entity that guides the development of the Ethereum consensus layer and ecosystem — and investor fears due to Ethereum's poor price action.\n\nRelated: Danny Ryan’s return? Ethereum wallets say yes\n\nEthereum has been trading well below its 200-day exponential moving average (EMA). Source: TradingView\n\nEthereum Foundation overhauls amid declining investor sentiment\n\nButerin announced sole authority over the Ethereum Foundation's leadership in January 2025 and rebuked the online community for their aggression toward Ethereum Foundation personnel.\n\n\"If you 'keep the pressure on', then you are creating an environment that is actively toxic to top talent,\" Buterin wrote in a January 21 X post.\n\nAs part of the administrative overhaul, the Foundation spun off new organizations tasked with managing and promoting various aspects of the Ethereum ecosystem.\n\nEtherealize will educate institutional investors, including Wall Street firms, hedge funds, and asset managers, about Ethereum and act as a marketing arm for the world's largest smart contract ecosystem.\n\nFollowing the announcement of the Etherealize marketing arm, the Ethereum Foundation launched the Silviculture Society — an advisory group tasked with upholding Ethereum's core values of open-source development, privacy, security, decentralization, and censorship resistance.\n\nThe 15 members appointed as advisors in the Silviculture Society. Source: Ethereum Foundation\n\nThe group consists of individuals outside the Ethereum Foundation and will advise the non-profit organization in an informal capacity.\n\nAt the time of this writing, the Silviculture Society has 15 members. However, it is unclear if the council will grow over time.\n\nEthereum has struggled to reclaim its previous all-time high of around $4,800 set in 2021, causing a collapse in confidence among investors, who have petitioned Vitalik Buterin to steer Ethereum in a new direction.\n\nMagazine: Pectra hard fork explained — Will it get Ethereum back on track?",
          "link": "https://cointelegraph.com/news/ethereum-developer-danny-ryan-joins-etheralize-co-founder?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "published": "2025-03-01T21:09:52"
        }
      ]
    },
    "cnn_business": {
      "rss": "http://rss.cnn.com/rss/money_news_international.rss",
      "link": "https://www.cnn.com/business",
      "articles": [
        {
          "title": "Mexico ready to retaliate by hurting American corn farmers",
          "text": "Mexico is ready to hit the U.S. where it hurts: Corn.\n\nMexico is one of the top buyers of American corn in the world today. And Mexican senator Armando Rios Piter, who leads a congressional committee on foreign relations, says he will introduce a bill this week where Mexico will buy corn from Brazil and Argentina instead of the United States.\n\nIt's one of the first signs of potential concrete action from Mexico in response to President Trump's threats against the country.\n\n\"I'm going to send a bill for the corn that we are buying in the Midwest and...change to Brazil or Argentina,\" Rios Piter, 43, told told CNN's Leyla Santiago on Sunday at an anti-Trump protest in Mexico City.\n\nHe added: It's a \"good way to tell them that this hostile relationship has consequences, hope that it changes.\"\n\nAmerican corn goes into a lot of the country's food. In Mexico City, from fine dining restaurants to taco stands on the street, corn-based favorites like tacos can be found everywhere.\n\nRelated: Mexican farmer's daughter: NAFTA destroyed us\n\nAmerica is also the world's largest producer and exporter of corn. American corn shipments to Mexico have catapulted since NAFTA, a free trade deal signed between Mexico, America and Canada.\n\nAmerican farmers sent $2.4 billion of corn to Mexico in 2015, the most recent year of available data. In 1995, the year after NAFTA became law, corn exports to Mexico were a mere $391 million.\n\nExperts say such a bill would be very costly to U.S. farmers.\n\n\"If we do indeed see a trade war where Mexico starts buying from Brazil...we're going to see it affect the corn market and ripple out to the rest of the ag economy,\" says Darin Newsom, senior analyst at DTN, an agricultural management firm.\n\nRios Piter's bill is another sign of Mexico's willingness to respond to Trump's threats. Trump wants to make Mexico pay for a wall on the border, and he's threatened taxes on Mexican imports ranging from 20% to 35%.\n\nTrump also wants to renegotiate NAFTA. He blames it for a flood of manufacturing jobs to Mexico. A nonpartisan congressional research report found that not to be true.\n\nRelated: Mexico doubles down on Trump 'contingency plan'\n\nStill, Trump says he wants a better trade deal for the American worker -- though he hasn't said what a better deal looks like.\n\nAll sides signaled two weeks ago that negotiations would begin in May after a 90-day consultation period.\n\nBut Trump says if negotiations don't bear the deal he wants, he threatens to withdraw from NAFTA.\n\nSuch tough talk isn't received well by Mexican leaders like Rios Piter. He's not alone. Mexico's economy minister, Ildefonso Guajardo, said in January Mexico would respond \"immediately\" to any tariffs from Trump.\n\n\"It's very clear that we have to be prepared to immediately be able to neutralize the impact of a measure of that nature,\" Guajardo said Jan. 13 on a Mexican news show.\n\n--Shasta Darlington contributed reporting to this story",
          "link": "http://money.cnn.com/2017/02/13/news/economy/mexico-trump-us-corn/index.html?section=money_news_international",
          "published": "2017-02-13T17:37:06"
        }
      ]
    },
    "financial_times": {
      "rss": "https://www.ft.com/rss/home",
      "link": "https://www.ft.com/",
      "articles": []
    },
    "forbes": {
      "rss": "https://www.forbes.com/investing/feed/",
      "link": "https://www.forbes.com/investing/",
      "articles": []
    },
    "fox_business": {
      "rss": "http://feeds.foxnews.com/foxnews/business",
      "link": "https://www.foxbusiness.com/",
      "articles": []
    },
    "marketwatch": {
      "rss": "https://www.marketwatch.com/rss",
      "link": "https://www.marketwatch.com/",
      "articles": []
    },
    "morningstar": {
      "rss": "https://www.morningstar.com/rss",
      "link": "https://www.morningstar.com/",
      "articles": []
    },
    "nytimes_business": {
      "rss": "https://rss.nytimes.com/services/xml/rss/nyt/Business.xml",
      "link": "https://www.nytimes.com/section/business",
      "articles": []
    },
    "reuters_markets": {
      "rss": "https://www.reutersagency.com/feed/?best-sectors=markets",
      "link": "https://www.reuters.com/markets/",
      "articles": []
    },
    "the_guardian_business": {
      "rss": "https://www.theguardian.com/uk/business/rss",
      "link": "https://www.theguardian.com/uk/business",
      "articles": []
    },
    "the_wall_street_journal": {
      "rss": "https://feeds.a.dj.com/rss/RSSMarketsMain.xml",
      "link": "https://www.wsj.com/market-data",
      "articles": []
    },
    "washington_post_business": {
      "rss": "http://feeds.washingtonpost.com/rss/business",
      "link": "https://www.washingtonpost.com/business/",
      "articles": []
    },
    "yahoo_finance": {
      "rss": "https://www.yahoo.com/news/rss/business",
      "link": "https://finance.yahoo.com/",
      "articles": []
    }
  }
}